{
    "tag": "brake_leak",
    "patterns": [
"I see fluid leaking near my brakes",
"Brake fluid is leaking",
"My brake pedal feels soft",
"Why is my brake fluid level low?",
"I noticed a puddle of fluid under my car near the wheels",
"There’s brake fluid leaking from the brake lines",
"I feel a loss of brake pressure",
"The brake pedal sinks to the floor",
"I hear a hissing sound near the brakes",
"My brake fluid warning light came on",
"There’s a strange smell when I brake",
"I’m losing brake fluid",
"The brakes feel spongy",
"There’s a fluid drip under my car near the brake area",
"My car is pulling to one side when I brake",
"I noticed brake fluid stains on my driveway",
"I hear a squealing noise when braking",
"The brakes don’t respond as quickly as they used to",
"My brakes seem weaker than normal",
"I’m having trouble stopping my car",
"The brake pedal is lower than usual",
"I’m losing brake effectiveness",
"The brakes make a grinding noise when applied",
"There’s a puddle of brake fluid under the car after parking",
"The car doesn’t stop as quickly as before",
"My brake warning light keeps flashing",
"I have to press the brake pedal harder to stop",
"I feel a vibration when braking",
"There’s a hissing sound from the brake system",
"I hear a gurgling noise when I apply the brakes",
"The brake pedal is slow to return after being pressed",
"I notice a decrease in braking performance",
"The brake fluid reservoir is empty or very low",
"There’s a noticeable delay in brake response",
"I can smell burning when I brake hard",
"The brakes feel inconsistent or unreliable",
"My brake lines might be damaged or cracked",
"The brake fluid level keeps dropping rapidly",
"I notice the brake fluid reservoir cap is loose",
"I see a wet spot near my brake caliper.",
"My brake pedal feels squishy when I press it.",
"The car takes longer to stop than usual.",
"I see fluid dripping from my wheel well.",
"My brake fluid keeps disappearing.",
"The brake pedal goes all the way down before stopping.",
"I hear a faint whistle when I press the brake.",
"My brakes feel less responsive than before.",
"There’s a wet stain near my rear wheels.",
"My brake lines look wet and oily.",
"I see fluid leaking from my master cylinder.",
"My brakes work sometimes but feel weak at other times.",
"The brake pedal feels bouncy when pressed.",
"There’s a weird wet spot near my front tires.",
"My brakes feel like they’re slipping.",
"I feel like I have to pump the brakes to stop.",
"My ABS light is on, and my brake pedal feels off.",
"The brake pedal vibrates when I try to stop.",
"My car doesn’t slow down as fast as before.",
"I noticed my brake pads are soaked in fluid.",
"My car makes a whining sound when I brake.",
"Brake fluid is pooling near my tire.",
"My braking distance has increased significantly.",
"I see bubbles forming in my brake fluid reservoir.",
"My brakes make a clicking noise when applied.",
"There’s an odd resistance in my brake pedal.",
"I see a fluid trail when I move my car.",
"My brake pedal feels like it’s losing pressure.",
"The car feels like it’s coasting instead of stopping.",
"My brakes feel completely different today.",
"I smell something sweet when I brake.",
"My rear brakes feel weaker than my front brakes.",
"I noticed a sudden drop in braking power.",
"The fluid under my car looks light yellow.",
"My car’s brakes seem to be failing gradually.",
"The brakes don’t feel firm anymore.",
"There’s a damp spot on my driveway near my front tires.",
"My emergency brake feels loose.",
"The brake pedal is sticking slightly when released.",
"My car jerks when I try to stop suddenly.",
"The brake reservoir cap has fluid around it.",
"I see bubbles in my brake lines.",
"My brakes are suddenly making a high-pitched sound.",
"The car lurches forward when I press the brake hard.",
"My brake booster feels weak.",
"I hear a slight gurgling sound when pressing the brake.",
"My brakes aren’t as responsive in traffic.",
"I noticed a sudden change in braking performance.",
"The brake fluid smells burnt.",
"My brakes feel dangerously unresponsive.",
"The fluid on my driveway is slick and oily.",
"My brakes sound like they’re hissing when I stop.",
"I feel a shudder when I brake hard.",
"My brake pedal feels stiffer than usual.",
"The brake pedal feels inconsistent when stopping.",
"I hear a sucking noise when I press the brake.",
"My brakes used to be smooth but now feel rough.",
"The car takes longer to stop in wet conditions.",
"I feel a sudden drop in brake pedal resistance.",
"The car shakes slightly when braking at high speeds.",
"There’s an unexplained loss of brake function.",
"The brakes feel sticky when I press them.",
"I see drips of fluid under my car after parking.",
"I noticed a decrease in my braking confidence.",
"There’s a squishy feeling in my brake pedal.",
"My brakes feel weaker when the car is hot.",
"I have to press my brakes harder than before.",
"I see wet spots forming near my brake drums.",
"My brake pedal makes a slight clicking sound.",
"There’s fluid leaking near my ABS module.",
"My braking feels erratic.",
"The car shudders when stopping at low speeds.",
"The brakes feel off, especially when going downhill.",
"I hear a faint whooshing noise when braking.",
"My car’s stopping distance has increased dramatically.",
"I feel like my car is rolling slightly before stopping.",
"I see a strange puddle near my car every morning.",
"The brake pedal doesn’t return to position quickly.",
"I see oil-like stains on my wheel rim.",
"My brake pedal suddenly went soft while driving.",
"My brakes lock up randomly.",
"The brake pedal keeps getting softer over time.",
"There’s a loss of brake feel after a long drive.",
"I feel like I have to stand on my brakes to stop.",
"I hear a faint air-leaking sound when I brake.",
"The car dips forward when braking at slow speeds.",
"My car is making a chirping noise when I brake.",
"The brakes feel mushy even after replacing pads.",
"The brake lines are wet but I don’t see a major leak.",
"The brake warning light flashes on and off randomly.",
"My brakes sometimes work fine, sometimes feel weak.",
"The brakes make a thumping sound when stopping.",
"There’s a fluid ring around my master cylinder.",
"I see fluid seeping from my brake bleeder valve.",
"My brake pedal feels like it’s pulsating.",
"I feel like my brakes aren’t catching properly.",
"The brake pedal feels looser than before.",
"My brakes aren’t engaging immediately.",
"I see fluid leaking from the rear axle area.",
"My brake booster seems unresponsive.",
"My handbrake feels weaker than before.",
"I feel a jerking motion when stopping.",
"My brakes don’t grip like they used to.",
"The brake pedal feels unsteady under my foot.",
"My car pulls slightly when I brake hard.",
"I see tiny bubbles in my brake fluid.",
"The brake pedal has lost all firmness.",
"My brakes sound like they’re leaking air.",
"The brake system isn’t holding pressure.",
"My brake pedal has no resistance at all.",
"The brakes seem to work, but they feel unreliable.",
"I hear a soft groaning noise when braking.",
"The braking response changes randomly.",
"My car wobbles when I try to brake.",
"I smell a weird chemical odor when stopping.",
"I can feel my brakes dragging slightly.",
"The brakes make a sloshing sound.",
"I hear a slight chirping sound when braking.",
"My brake reservoir fluid looks dirty or contaminated.",
"The car vibrates heavily when braking from high speeds.",
"My brake pedal is uncomfortably soft.",
"I have to double pump my brakes to stop properly.",
"There’s an air bubble sensation in my brake pedal.",
"My brakes used to work fine, now they don’t.",
"The brake system seems to be leaking somewhere.",
"My car shakes violently when braking hard.",
"I noticed brake fluid residue inside my wheel.",
"The brake pressure seems to drop randomly.",
"My car has a delayed response when braking.",
"The brakes give out momentarily before engaging.",
"My rear brakes don’t seem to be working as well.",
"I hear a faint ticking noise when braking.",
"The car leans forward harder than usual when stopping.",
"My brake pedal has an unusual side-to-side movement.",
"The brake master cylinder looks like it’s leaking.",
"The brake fluid level is fine but braking feels off.",
"I smell a faint gasoline-like odor when braking.",
"My brakes make a dull thudding sound.",
"The braking response feels completely different.",
"I hear an odd faint beeping noise when braking.",
"My car’s brake assist doesn’t seem to work anymore.",
"The brakes sometimes grab too hard, sometimes not enough."

    ],
    "responses": [
      "Your brake lines may be leaking. Check for visible leaks and refill brake fluid if necessary. A mechanic should inspect and repair the brake lines immediately. You may need to order a **Brake Inspection & Repair** service.",
      "A brake fluid leak can reduce braking efficiency. Look for wet spots near the wheels or under the car and get the brake system checked as soon as possible. Consider booking a **Brake Inspection & Repair** service."
    ]
  },
  {
    "tag": "brake_wear_damage",
    "patterns": [
      "My brakes are making a squealing noise",
      "my brakes arent working",
      "my brakes are not working what to do",
      "my brakes stopped working while driving",
      "the brakes aren't working",
      "I hear grinding sounds when braking",
      "Why does my car take longer to stop?",
      "My brake pads are worn out",
      "Brake pedal feels spongy",
      "There’s a screeching sound when I press the brakes",
"My car takes longer to stop than usual",
"The brakes are not as responsive as before",
"I feel vibrations in the brake pedal",
"The brakes make a metallic grinding noise",
"I notice reduced braking power",
"My brake pedal is soft or spongy",
"The car feels like it takes more effort to stop",
"The car pulls to one side when braking",
"I hear a high-pitched squeal when I brake",
"The brakes make a scraping noise",
"My brake warning light came on",
"There’s a grinding sound when I brake hard",
"I’m hearing unusual noises from the brakes",
"The car doesn’t stop as quickly as it used to",
"My brake pads look thin or worn down",
"There’s a rumbling sound when I apply the brakes",
"I feel the brake pedal pulsating when I brake",
"The brakes make a rubbing sound",
"My brake pedal goes all the way to the floor",
"The brakes are not stopping the car effectively",
"I hear a metal-on-metal sound when braking",
"There’s a loss of braking power when I press the pedal",
"The car makes a thumping noise when braking",
"My brake rotors look uneven or damaged",
"I feel the steering wheel shaking when I brake",
"I hear a clicking sound from the brakes",
"There’s a loud clunk when I press the brakes",
"The brakes don’t feel as firm as they should",
"My brake fluid is low, and the car takes longer to stop",
"There’s a harsh vibration in the brake pedal",
"I feel a lack of control when braking",
"My car pulls to one side during braking",
"There’s a soft spot in the brake pedal",
"My car stops unevenly, with one side braking harder",
"My car jerks when coming to a stop.",
"The brakes feel rough when slowing down.",
"My brake pads are extremely thin.",
"I hear a deep growl when I press the brakes.",
"The brake pedal feels stiffer than before.",
"My car makes a scraping noise when stopping.",
"I see brake dust all over my wheels.",
"The car makes a loud groaning noise when braking.",
"My brakes feel weaker after a long drive.",
"I feel resistance when pressing the brake pedal.",
"The brake pedal bounces slightly under my foot.",
"My car shakes when braking downhill.",
"I hear a constant chirping sound from my brakes.",
"The brakes sound like they’re scraping metal.",
"My car lurches forward when I try to stop.",
"The car's brakes feel inconsistent.",
"I hear a sharp screech when braking at low speeds.",
"My brake pedal vibrates at highway speeds.",
"The stopping distance has increased suddenly.",
"My car's braking power fades after repeated use.",
"I hear a hollow clunk when pressing the brake.",
"The brakes grab too hard sometimes.",
"My brakes sound like they're dragging.",
"I see visible grooves on my brake rotors.",
"My car takes longer to stop in wet conditions.",
"The brake pedal feels jumpy at times.",
"I hear a knocking sound when applying the brakes.",
"My brake pedal gets stuck momentarily.",
"There’s a burning smell after hard braking.",
"I feel like my brakes are slipping.",
"My brake fluid level keeps dropping slightly.",
"The car sways slightly when braking hard.",
"My brake pedal suddenly feels softer.",
"I hear a whirring sound when pressing the brake.",
"My brakes don't work well when driving fast.",
"The car makes a flapping sound when stopping.",
"I feel like my brakes engage too late.",
"My brakes get extremely hot after short drives.",
"I hear a faint rattle when I tap the brake.",
"The braking force seems to fluctuate randomly.",
"My car feels unstable when coming to a stop.",
"I hear a popping sound when braking hard.",
"The car's braking feels rough and uneven.",
"I notice an odd resistance in my brake pedal.",
"My brakes feel like they’re pulsing.",
"The car shakes violently when braking fast.",
"I hear a low groaning noise from my brakes.",
"My car slows down slower than expected.",
"I feel an odd shuddering when braking downhill.",
"The car skids slightly when I brake hard.",
"I hear a clicking noise when braking slowly.",
"My brakes don’t seem to grip properly.",
"The car lurches slightly when braking gently.",
"I feel like I have to push my brake pedal harder.",
"My car struggles to stop at stop signs.",
"The brake pedal takes a second to respond.",
"I hear a deep vibration from my brake rotors.",
"My car makes a whining noise when braking.",
"The brake pedal sometimes sticks slightly.",
"My brake pads feel completely worn down.",
"I notice uneven wear on my brake pads.",
"I hear a scraping sound even when not braking.",
"My brakes feel sluggish when stopping suddenly.",
"I hear a rattling sound when braking on rough roads.",
"My car takes extra effort to stop when towing.",
"The brakes feel like they engage too slowly.",
"The brake pedal moves slightly on its own.",
"I feel like my brakes are grabbing inconsistently.",
"My steering wheel shakes when I brake hard.",
"The car wobbles slightly when stopping fast.",
"I hear a faint thudding noise from my brakes.",
"My brakes make a chirping sound when cold.",
"The braking feels weak when the car is hot.",
"My car takes extra effort to stop in traffic.",
"My brake pedal doesn’t feel responsive.",
"I hear a dragging noise coming from my wheels.",
"The brakes sound louder than normal.",
"I feel a sharp jerk when braking hard.",
"My car's brakes fade when going downhill.",
"I hear a knocking noise from the brake calipers.",
"The braking feels inconsistent on long drives.",
"My brakes make a groaning noise when hot.",
"The car takes longer to stop after long trips.",
"I feel my brakes shuddering when slowing down.",
"My car makes a squeak before coming to a stop.",
"The brake pedal seems to require extra force.",
"I hear a rubbing sound from my brake rotors.",
"My brakes make a deep humming sound at low speeds.",
"The brake pedal sinks slightly when idling.",
"I hear a faint rattle from the brake calipers.",
"My brakes make a weird fluttering sound.",
"The car's brakes hesitate before engaging.",
"I hear a faint metallic ping when braking.",
"The brake pedal seems bouncier than normal.",
"My brakes make a strange thumping sound.",
"I hear a quiet clatter from my brakes.",
"The brakes make a vibrating sound when stopping.",
"My brake pedal feels too light.",
"I hear a hissing noise when releasing the brake.",
"My car slows down unevenly.",
"The brakes feel different every time I use them.",
"My car rolls slightly before stopping completely.",
"I hear a faint whine from my brakes at slow speeds.",
"The car shudders slightly when stopping gently.",
"My brakes seem to work worse in cold weather.",
"I hear a sharp tapping noise when braking hard.",
"My brake pedal feels too soft when cold.",
"I hear a faint ticking sound from my wheels.",
"My car doesn’t stop smoothly anymore.",
"I hear a faint pop when tapping the brakes.",
"My brakes sound like they’re rattling.",
"I feel a brief delay when pressing the brakes.",
"The car shakes when braking at high speeds.",
"My brake pedal wobbles slightly underfoot.",
"I hear a high-pitched noise when braking lightly.",
"My brakes make a dull thunk noise when stopping.",
"The car feels unstable when slowing down quickly.",
"I hear a deep growl when braking in reverse.",
"The brakes make a low-pitched groaning sound.",
"My car makes a dull droning noise when braking.",
"The braking feels less predictable than before.",
"My car rocks forward when braking hard.",
"The brake pedal sometimes pushes back slightly.",
"I hear a clicking sound from my wheels when braking.",
"My brakes make a creaking sound at slow speeds.",
"The brake pedal shudders when braking downhill.",
"I hear a faint metallic ping when coming to a stop.",
"My car makes a dull moaning sound when stopping.",
"The braking force fades when driving for long periods.",
"My brakes make a snapping sound when engaging.",
"I hear a strange pulsing noise from my brake system.",
"The car wobbles slightly when stopping on hills.",
"I hear a soft rattle when braking on rough roads.",
"The brake pedal seems to move on its own slightly.",
"My brakes feel more aggressive at certain speeds.",
"I hear a weird fluttering noise when stopping fast.",
"My brake pedal sticks momentarily when pressed.",
"I feel an odd wobbling in my brake pedal.",
"The car sways slightly when braking quickly.",
"My brake rotors seem to make a scraping noise.",
"The brakes feel less grippy than before.",
"My brakes sound like they’re vibrating slightly.",
"one of my brakes aren't working properly",
"I hear a knocking noise when braking at low speeds."

    ],
    "responses": [
      "Your brake pads or rotors might be worn out. Consider getting them inspected and replaced if necessary. Booking a **Brake Inspection & Repair** service can help ensure your safety.",
      "Grinding or squealing noises often indicate worn-out brake pads. Driving with worn brakes can damage the rotors, so it's best to replace them soon. A **Brake Inspection & Repair** service is recommended."
    ]
  },


  {
    "tag": "brake_leak",
    "patterns": [
      "I see brake fluid leaking near my wheels",
      "Brake fluid is dripping under my car",
      "My brake pedal feels softer than before",
      "Why is my brake fluid disappearing?",
      "There’s a puddle of liquid near my tires",
      "Brake lines are wet and oily",
      "I feel a sudden loss of brake pressure",
      "The brake pedal sinks when pressed",
      "I hear a faint hissing sound near the brakes",
      "My brake warning light turned on",
      "There’s an odd smell when I brake",
      "I noticed brake fluid stains in my driveway",
      "My brakes feel spongy and weak",
      "Brake fluid keeps dropping without reason",
      "There’s a strange wet spot near my brake caliper",
      "My car pulls to one side when braking",
      "The brakes don’t respond as well as before",
      "My brake pedal feels bouncy when pressed",
      "I have to press the brake pedal harder to stop",
      "The brake fluid reservoir is nearly empty",
      "There’s a delay when I press the brake pedal",
      "Brake fluid is leaking from my master cylinder",
      "I hear a faint whistle when pressing the brakes",
      "I feel like my brakes are slipping",
      "My ABS light is on, and my brake pedal feels off",
      "There’s a noticeable decline in brake performance",
      "I smell something sweet when braking",
      "The brake pedal keeps getting softer over time",
      "Brake fluid pools under my car when parked",
      "There’s fluid near my rear tires",
      "The brakes feel squishier in traffic",
      "My car takes longer to stop than usual",
      "The brake booster isn’t working properly",
      "I feel like I have to pump the brakes",
      "There’s an unexplained loss of brake function",
      "Brake pressure drops after long drives",
      "My car feels like it’s coasting when braking",
      "I noticed bubbles in the brake fluid reservoir",
      "The brakes feel inconsistent",
      "Brake fluid stains keep appearing on my driveway",
      "Brake lines seem cracked or damaged",
      "Fluid is leaking from the ABS module",
      "My emergency brake feels loose",
      "Brake pedal is sticking slightly when released",
      "My braking distance has increased significantly",
      "I see a wet stain near my front tires",
      "Brake pedal goes all the way down before stopping",
      "I hear a faint air-leaking sound when braking",
      "The brake pedal vibrates when stopping",
      "My brake reservoir cap has fluid around it",
      "My brakes aren’t engaging properly",
      "There’s an odd resistance in my brake pedal",
      "Brake system feels unreliable",
      "Brakes seem weaker when car is hot",
      "I hear a gurgling noise when braking",
      "Brake fluid level keeps dropping",
      "There’s an air bubble sensation in the brake pedal",
      "Braking response changes randomly",
      "There’s a sloshing sound in the brake system",
      "I feel a shudder when braking hard",
      "Brake pedal moves slightly side-to-side",
      "Brakes are making an unusual whooshing sound",
      "Braking feels unpredictable",
      "Brakes aren’t as effective when wet",
      "Fluid is leaking near the brake bleeder valve",
      "Brake pedal sticks before releasing",
      "My car wobbles slightly when braking",
      "There’s fluid leaking from the rear axle",
      "Brakes sometimes feel fine, other times weak",
      "My brake pedal pulsates when pressed",
      "Fluid ring appears around my master cylinder",
      "Braking power fades after long use",
      "I hear a sucking noise when pressing the brake",
      "Brake warning light flashes on and off randomly",
      "Brakes feel more effective at certain speeds",
      "My handbrake feels weaker",
      "Brakes feel unstable when stopping fast",
      "Fluid stains appear on my wheel rim",
      "Brakes make a faint chirping sound when braking",
      "There’s a sudden drop in brake pedal resistance",
      "Brake pedal seems bouncier than normal",
      "Brakes feel like they randomly lose pressure",
      "My car takes extra effort to stop in traffic",
      "The car dips forward suddenly when braking",
      "Brake pedal has no resistance at all",
      "Brakes are suddenly making a hissing noise",
      "I feel like my car is rolling slightly before stopping",
      "Brake system doesn’t seem to hold pressure",
      "There’s an unexplained change in braking feel",
      "Brake pedal moves unexpectedly when stopping",
      "Brake system seems to lose pressure overnight",
      "Brakes sound like they’re leaking air",
      "There’s a fluid trail when I move my car",
      "My brakes aren’t working as well in the morning",
      "Brakes are less effective after rain",
      "Brake pedal feels dangerously soft",
      "Brakes used to be smooth but now feel rough",
      "I hear a faint ticking noise when braking",
      "Brake fluid reservoir cap is loose",
      "Braking distance increases unexpectedly",
      "I smell a faint burnt scent when braking",
      "Brakes sound like they’re gurgling",
      "Brake pedal suddenly went soft while driving",
      "Braking feels different every time",
      "My car wobbles when braking at high speeds",
      "I noticed brake fluid residue inside my wheel",
      "Brakes give out momentarily before engaging",
      "Braking response seems delayed",
      "There’s a fluid ring around my brake master cylinder",
      "I feel like I have to stand on my brakes",
      "Brakes feel completely different than yesterday",
      "The brake master cylinder looks like it’s leaking"
    ],
    "responses": [
      "Your brake lines may be leaking. Check for visible leaks and refill brake fluid if necessary. A mechanic should inspect and repair the brake lines immediately. You may need to order a **Brake Inspection & Repair** service.",
      "A brake fluid leak can reduce braking efficiency. Look for wet spots near the wheels or under the car and get the brake system checked as soon as possible. Consider booking a **Brake Inspection & Repair** service."
    ]
  },
  
  {
    "tag": "brake_wear_damage",
    "patterns": [
      "My brakes are making a grinding noise",
      "I hear a screeching sound when I brake",
      "Brakes are squealing loudly every time I stop",
      "I feel vibrations in the brake pedal",
      "The brake pedal feels rough when pressed",
      "Brakes are less effective than before",
      "There’s a metal-on-metal sound when braking",
      "My brakes are making a rattling noise",
      "Stopping distance has increased significantly",
      "My car pulls to one side when braking",
      "Brakes feel weak even after replacing pads",
      "The brake pedal feels stiffer than usual",
      "Brakes take longer to respond",
      "I hear a clicking noise when I press the brake pedal",
      "Brakes sound like they’re scraping against something",
      "I feel a pulsation in the brake pedal",
      "Brakes shudder when coming to a stop",
      "There’s an unusual resistance when braking",
      "The braking power is inconsistent",
      "Brakes seem to fade after repeated use",
      "I hear a thudding sound when braking",
      "Brake pads seem to be wearing unevenly",
      "Brakes feel rough when coming to a complete stop",
      "The braking force isn’t as strong as it used to be",
      "I hear a whirring sound when pressing the brakes",
      "Brakes make a chirping noise when stopping",
      "Braking feels harsh on my feet",
      "My rotors seem to be worn down",
      "Brakes feel spongy even with new pads",
      "My car vibrates when braking at high speeds",
      "Brakes sound like they’re scraping metal",
      "Braking efficiency is lower than before",
      "Brakes feel like they’re grinding down",
      "Brakes make a deep groaning noise",
      "My braking distance is much longer now",
      "The car jolts when applying the brakes",
      "Brakes are inconsistent in performance",
      "I hear a harsh rubbing sound when braking",
      "Brakes don’t feel as smooth as before",
      "The car shakes when braking hard",
      "Brake pedal feels like it’s pushing back",
      "Brakes seem to slip before catching",
      "Braking power decreases on long drives",
      "Brakes are getting noisier over time",
      "Brakes make a high-pitched noise even when not braking",
      "My brake discs look damaged",
      "Brakes don’t work well in cold weather",
      "Brakes feel unresponsive when driving downhill",
      "I feel a strange resistance when braking",
      "Brakes produce a strange burning smell",
      "Braking performance drops suddenly",
      "Brakes sound like they’re rattling",
      "My brakes are wearing out too quickly",
      "Brakes have become progressively louder",
      "I feel shaking in my steering wheel when braking",
      "Brakes feel harder to press than before",
      "I hear a low growling sound when I brake",
      "The car lurches forward when I release the brake",
      "Brake wear indicators are making noise",
      "Brakes don’t seem to grip properly",
      "There’s an odd delay when I press the brake pedal",
      "Braking feels like it’s slowing unevenly",
      "Brakes are more effective at low speeds but not high speeds",
      "The brake pads seem too thin",
      "I hear a buzzing sound when braking",
      "Brakes don’t engage smoothly anymore",
      "Brakes sound like they’re vibrating",
      "Brakes feel rougher on rainy days",
      "Braking causes my car to wobble slightly",
      "My brakes feel like they’re dragging",
      "Braking produces an odd scraping sensation",
      "My brakes squeak even after replacing pads",
      "Brakes don’t seem to hold pressure properly",
      "There’s an odd humming sound when braking",
      "Brakes feel soft at first and then suddenly grip",
      "Brakes are becoming progressively weaker",
      "Braking performance changes from day to day",
      "Brakes sound like they’re struggling to hold",
      "I hear a harsh metallic grinding when braking",
      "Brakes don’t seem as sensitive as before",
      "Braking feels sluggish after long drives",
      "Brakes don’t seem as effective in traffic",
      "The brake pedal feels inconsistent",
      "Brakes seem to require more effort over time",
      "Braking feels jittery and uneven",
      "Brakes sound like they’re shaking",
      "Brakes squeal even on light braking",
      "Brakes struggle to stop the car smoothly",
      "I feel like my car jerks when braking",
      "Braking makes the whole car tremble slightly",
      "Brakes feel like they have a slight delay",
      "Brakes seem weaker when the car is hot",
      "I feel like I have to slam on the brakes",
      "Braking makes my dashboard rattle",
      "Brakes seem to be catching unevenly",
      "Brakes sound like they’re rubbing against something",
      "Brakes don’t seem to work well at high speeds",
      "Brakes make a strange pinging noise",
      "Braking distance increases suddenly",
      "Brakes feel like they’re losing grip over time",
      "Braking makes my tires squeak",
      "Brakes vibrate in pulses",
      "Braking is rougher in wet conditions",
      "Braking power drops significantly in the morning",
      "I hear a strange knocking sound when braking",
      "Braking is unpredictable in heavy traffic",
      "Brakes make a low moaning sound",
      "Braking feels less responsive after long drives",
      "Brakes are making a loud creaking noise",
      "Brakes don’t stop the car as smoothly anymore",
      "Braking makes a sharp clicking sound",
      "Brakes are behaving differently every time I use them",
      "Braking at a stoplight feels rough",
      "Brakes feel sluggish on steep roads",
      "Braking has become more difficult over time",
      "Brakes are making an odd rhythmic noise",
      "Brakes feel oddly stiff at times",
      "Brakes seem weaker after driving on the highway",
      "Braking makes my whole car shake slightly"
    ],
    "responses": [
      "Your brake pads or rotors may be worn out. Inspect them for damage and replace them if necessary. Consider booking a **Brake Pad & Rotor Replacement** service.",
      "Brake wear can lead to decreased stopping power. Get your brake system checked and serviced as soon as possible to ensure safety. You may need a **Brake System Inspection & Repair** service."
    ]
  }
  