   
                  
                  
                    {
                        "tag": "what services do you have",
                        "patterns":[
                            "what services are there?",
                            "what services do you provide",
                            "what are the services here",
                            "tell me the services there"
                        ],
                        "responses":[
                            "Here are the services we have:\n1. Car Wash\nDescription: A professional cleaning service for vehicles, including exterior washing, interior vacuuming, and detailing.\n\n2. Oil Change\nDescription: Replacement of engine oil and oil filter to maintain vehicle performance and longevity.\n\n3. Tire Replacement & Repair\nDescription: Services for fixing punctured tires, replacing worn-out tires, and balancing for optimal driving performance.\n\n4. Battery Replacement\nDescription: Checking battery health and replacing dead or weak vehicle batteries with new ones.\n\n5. Roadside Assistance\nDescription: Emergency service for jump-starting a dead battery, towing, fuel delivery, or helping with a flat tire.\n\n6. Brake Inspection & Repair\nDescription: Examination of brake pads, discs, and fluid levels to ensure safe braking performance.\n\n7. Car Diagnostic Service\nDescription: A full system check-up using diagnostic tools to detect engine, transmission, or electrical issues.\n\n8. Air Conditioning Repair & Recharge\nDescription: Inspection and recharging of the vehicle’s air conditioning system to maintain cooling efficiency.\n\n9. Engine Tune-Up\nDescription: Maintenance of the engine by adjusting or replacing spark plugs, filters, and timing belts for better performance.\n\n10. Windshield Repair & Replacement\nDescription: Fixing small cracks or replacing the entire windshield if necessary for clear visibility.\n\n11. Tow Truck Service\nDescription: Vehicle towing assistance for breakdowns, accidents, or illegal parking situations. A tow truck will be dispatched to transport the vehicle to a repair shop or another desired location.\nFeel free to order the one that solves your problem!"
            
                        ]
            
                    },
                  {
                        "tag": "steering_wheel_feels_stiff",
                        "patterns": [
                          "My steering wheel is hard to turn",
                          "The steering feels stiff",
                          "I struggle to turn the wheel"
                        ],
                        "responses": [
                          "A stiff steering wheel can be caused by low power steering fluid, a failing power steering pump, or issues with the steering rack. A Car Diagnostic Service can identify the problem."
                        ]
                      },
                      {
                        "tag": "steering_wheel_vibrates_or_shakes",
                        "patterns": [
                          "My steering wheel shakes while driving",
                          "The wheel vibrates when I turn",
                          "I feel a wobble in the steering"
                        ],
                        "responses": [
                          "A vibrating steering wheel could be due to unbalanced tires, worn-out suspension components, or issues with the power steering system. A Tire Replacement & Repair or Car Diagnostic Service can help."
                        ]
                      },
                      {
                        "tag": "steering_wheel_makes_noise_when_turning",
                        "patterns": [
                          "I hear a squeaking noise when I turn the wheel",
                          "My steering makes a whining sound",
                          "There’s a clunking noise when turning"
                        ],
                        "responses": [
                          "Unusual noises when turning the steering wheel may indicate a low power steering fluid level, a worn-out steering belt, or faulty suspension parts. A Car Diagnostic Service is recommended."
                        ]
                      },
                      {
                        "tag": "steering_pulls_to_one_side",
                        "patterns": [
                          "My car drifts to one side",
                          "The steering pulls to the left or right",
                          "I have to constantly correct the steering"
                        ],
                        "responses": [
                          "If your car pulls to one side, it could be due to improper wheel alignment, uneven tire pressure, or brake issues. A Tire Replacement & Repair or Brake Inspection & Repair service can help."
                        ]
                      },
                      {
                        "tag": "steering_wheel_feels_loose_or_unresponsive",
                        "patterns": [
                          "My steering wheel feels too loose",
                          "There’s too much play in the steering",
                          "The steering is unresponsive"
                        ],
                        "responses": [
                          "A loose or unresponsive steering wheel may indicate worn-out tie rods, steering column issues, or a failing steering rack. A Car Diagnostic Service is recommended."
                        ]
                      },
                      {
                        "tag": "power_steering_fluid_leak",
                        "patterns": [
                          "I see fluid leaking near the front wheels",
                          "My power steering fluid is low",
                          "There’s a reddish fluid under my car"
                        ],
                        "responses": [
                          "A power steering fluid leak can cause steering problems and should be fixed as soon as possible. A Car Diagnostic Service can locate and repair the leak."
                        ]
                      },
                      {
                          "tag": "brake_pad_wear_indicator",
                          "patterns": [
                            "Can brake pads make a squeaking noise?",
                            "Why do my brakes squeal when I drive slowly?",
                            "Why do my brakes make a squealing sound only when stopping?",
                            "What does a brake wear indicator sound like?",
                            "Why do my brakes only squeak in the morning?"
                          ],
                          "responses": [
                            "Many brake pads have wear indicators that create a squealing noise to warn you that it's time to replace them. If your brakes squeal persistently, you should get a Brake Inspection & Repair service."
                          ]
                        },
                        {
                          "tag": "moisture_on_rotors",
                          "patterns": [
                            "Why do my brakes squeak in the morning?",
                            "Why do my brakes make noise when it's cold or wet?",
                            "What causes brakes to squeak after rain?",
                            "Why do my brakes sound weird after washing my car?",
                            "Can water cause my brakes to squeak?"
                          ],
                          "responses": [
                            "Moisture on your brake rotors can cause temporary squeaking, especially in the morning or after rain. This noise usually disappears after a few stops. If it persists, consider a Brake Inspection & Repair service."
                          ]
                        },
                        {
                          "tag": "brake_dust_and_debris",
                          "patterns": [
                            "Can brake dust cause squeaky brakes?",
                            "Why do my brakes make noise even though the pads are new?",
                            "Why do my brakes squeal after getting new pads?",
                            "How do I stop my brakes from squeaking?",
                            "Why do my brakes sound high-pitched when stopping?"
                          ],
                          "responses": [
                            "Brake dust, dirt, or debris can build up on your brake pads and rotors, causing a squeaking sound. Cleaning or replacing the pads may help. You may need a Brake Inspection & Repair service."
                          ]
                        },
                        {
                          "tag": "glazed_brake_pads_or_rotors",
                          "patterns": [
                            "Why do my brakes make a screeching noise?",
                            "What happens if my brakes overheat?",
                            "Can overheated brakes make noise?",
                            "Why do my brakes feel unresponsive?",
                            "Why do my brakes make a high-pitched noise after long drives?"
                          ],
                          "responses": [
                            "Overheated brakes can cause the pads and rotors to glaze over, leading to squeaking or reduced braking performance. Resurfacing or replacing the brake components may be needed. You may need a Brake Inspection & Repair service."
                          ]
                        },
                        {
                          "tag": "foreign_objects_in_brakes",
                          "patterns": [
                            "Why do my brakes squeal randomly?",
                            "Can rocks get stuck in my brakes?",
                            "Why do my brakes sound like they have something stuck?",
                            "What causes brakes to make a grinding noise without wear?",
                            "Why do my brakes suddenly make noise?"
                          ],
                          "responses": [
                            "Small rocks, debris, or rust buildup can get lodged in the brake system, causing squeaking or grinding noises. A professional inspection can help remove any foreign objects. You may need a Brake Inspection & Repair service."
                          ]
                        },
                        {
                          "tag": "low_brake_fluid",
                          "patterns": [
                            "Can low brake fluid cause squeaky brakes?",
                            "Why do my brakes make noise when I press the pedal?",
                            "What happens if my brake fluid is low?",
                            "Why does my car feel slow to stop?",
                            "Why do my brakes make a squeaky sound when I press them?"
                          ],
                          "responses": [
                            "Low brake fluid can reduce braking efficiency and cause noises due to increased friction. Topping up or flushing the brake fluid may help. You may need a Brake Inspection & Repair service."
                          ]
                        },
                      {
                        "tag": "steering_wheel_does_not_return_to_center",
                        "patterns": [
                          "My steering wheel stays turned after I let go",
                          "The wheel doesn’t center itself after a turn",
                          "I have to manually straighten my steering wheel"
                        ],
                        "responses": [
                          "A steering wheel that doesn’t return to the center position may indicate a problem with the alignment, suspension, or power steering system. A Tire Replacement & Repair or Car Diagnostic Service is recommended."
                        ]
                      },
                      {
                        "tag": "steering_wheel_locks_while_driving",
                        "patterns": [
                          "My steering wheel locks up while driving",
                          "I can’t turn my steering wheel suddenly",
                          "The steering wheel becomes stuck while moving"
                        ],
                        "responses": [
                          "A locked steering wheel while driving is a serious issue that could be caused by a failing power steering system or a malfunctioning ignition switch. A Car Diagnostic Service is urgently needed."
                        ]
                      },
                      {
                          "tag": "brakes_vibrate_or_pulsate",
                          "patterns": [
                            "My car shakes when I brake",
                            "The brake pedal vibrates when stopping",
                            "I feel pulsing in the brakes"
                          ],
                          "responses": [
                            "Brake vibration or pulsation may be caused by unevenly worn brake pads or warped brake rotors. A Brake Inspection & Repair service can fix the issue."
                          ]
                        },
                        {
                          "tag": "brakes_make_a_clunking_noise",
                          "patterns": [
                            "I hear a clunking sound when braking",
                            "There’s a knocking noise when I press the brakes",
                            "My brakes sound like they’re loose"
                          ],
                          "responses": [
                            "A clunking noise when braking could be caused by loose or misaligned brake components. A Brake Inspection & Repair service is needed to check for any faults."
                          ]
                        },
                        {
                          "tag": "brake_pedal_feels_soft_or_spongy",
                          "patterns": [
                            "My brake pedal feels soft",
                            "I have to press the brake pedal all the way down",
                            "Brakes feel spongy when I press them"
                          ],
                          "responses": [
                            "A soft or spongy brake pedal can indicate air in the brake lines, low brake fluid, or worn-out brake pads. A Brake Inspection & Repair service can diagnose and fix the issue."
                          ]
                        },
                        {
                          "tag": "brake_pads_worn_out",
                          "patterns": [
                            "My brakes take longer to stop",
                            "I think my brake pads are worn out",
                            "The braking performance is weak"
                          ],
                          "responses": [
                            "Worn-out brake pads can reduce braking efficiency and increase stopping distance, making driving unsafe. A Brake Inspection & Repair service is recommended."
                          ]
                        },
                        {
                          "tag": "squeaking_or_squealing_brakes",
                          "patterns": [
                              "Why are my brakes squeaking or grinding?",
                              "Why are my brakes squeaking?",
                              "Why do my brakes make a high-pitched squeal?",
                              "What causes squeaky brakes?",
                              "Why do my brakes make noise when I press the pedal?",
                              "Why are my brakes making a chirping or screeching sound?",
                              "My brakes make a squeaking sound",
                              "There’s a high-pitched noise when I brake",
                              "I hear squealing when stopping"
                          ],
                          "responses": [
                            "A squeaking noise when braking is often a sign that your brake pads are wearing out. Booking a Brake Inspection & Repair service will help ensure your safety."
                          ]
                        },
                        {
                          "tag": "brake_grinding",
                          "patterns": [
                            "Why are my brakes grinding?",
                            "What causes grinding noise when braking?",
                            "Why do my brakes sound rough when I stop?",
                            "Why do my brakes make a loud grinding sound?",
                            "What does it mean if my brakes grind when I slow down?"
                          ],
                          "responses": [
                            "Grinding brakes often indicate that your brake pads are completely worn out, causing metal-to-metal contact. This can damage your rotors and should be fixed immediately. You may need a Brake Inspection & Repair service."
                          ]
                        },
                        {
                          "tag": "flat_tire",
                          "patterns": [
                            "My tire is flat",
                            "I have a flat tire",
                            "One of my tires lost all air",
                            "I need help with a flat tire"
                          ],
                          "responses": [
                            "A flat tire can be caused by a puncture, air leak, or damage to the tire structure. You may need a Tire Replacement & Repair or Roadside Assistance service."
                          ]
                        },
                        {
                          "tag": "tire_punctured",
                          "patterns": [
                            "My tire has a hole in it",
                            "I think my tire is punctured",
                            "I ran over a nail and my tire is leaking air"
                          ],
                          "responses": [
                            "A punctured tire can be repaired if the damage is small and not on the sidewall. You should book a Tire Replacement & Repair service to assess and fix the issue."
                          ]
                        },
                        {
                          "tag": "slow_tire_air_leak",
                          "patterns": [
                            "My tire loses air slowly",
                            "I have to inflate my tire frequently",
                            "One of my tires keeps getting low on air"
                          ],
                          "responses": [
                            "A slow air leak could be due to a minor puncture, a faulty valve, or rim damage. A Tire Replacement & Repair service can diagnose and fix the issue."
                          ]
                        },
                        {
                          "tag": "multiple_flat_tires",
                          "patterns": [
                            "Two of my tires are flat",
                            "I have multiple flat tires",
                            "More than one of my tires is completely out of air"
                          ],
                          "responses": [
                            "Having multiple flat tires can leave your car undrivable. You may need a Tow Truck Service to transport your vehicle or a Tire Replacement & Repair service for on-site assistance."
                          ]
                        },
                        {
                          "tag": "tire_burst",
                          "patterns": [
                            "My tire suddenly exploded",
                            "I had a blowout on the highway",
                            "My tire burst while driving"
                          ],
                          "responses": [
                            "A tire blowout is dangerous and can be caused by excessive wear, high temperatures, or impact damage. A Tire Replacement & Repair service is required to install a new tire."
                          ]
                        },
                        {
                          "tag": "spare_tire_needed",
                          "patterns": [
                            "I don’t have a spare tire",
                            "Can someone bring me a spare tire?",
                            "I need a new tire since I don’t have a spare"
                          ],
                          "responses": [
                            "If you don't have a spare tire, you can request a Roadside Assistance or Tire Replacement & Repair service to get back on the road safely."
                          ]
                        },
                        {
                          "tag": "high_oil_consumption",
                          "patterns": [
                            "My car is using too much oil",
                            "I have to refill engine oil too often",
                            "Why does my car burn oil so fast?",
                            "The oil level drops too quickly",
                            "I keep getting low oil warnings"
                          ],
                          "responses": [
                            "Excessive oil consumption could be due to worn piston rings, valve seals, or leaks in the engine. An Engine Tune-Up or Car Diagnostic Service is recommended to diagnose the problem."
                          ]
                        },
                        {
                          "tag": "blue_smoke_from_exhaust",
                          "patterns": [
                            "My car emits blue smoke",
                            "I see blue smoke from my exhaust",
                            "My engine burns oil",
                            "Why does my exhaust smell like burning oil?"
                          ],
                          "responses": [
                            "Blue smoke from the exhaust indicates oil burning in the engine, often due to worn piston rings or valve seals. An Engine Tune-Up or Car Diagnostic Service can help address the issue."
                          ]
                        },
                        {
                          "tag": "contaminated_or_old_oil",
                          "patterns": [
                            "My oil is dark and thick",
                            "The engine oil looks dirty",
                            "My car runs rough, could it be the oil?"
                          ],
                          "responses": [
                            "Dirty or old oil loses its lubricating properties, leading to engine wear. Regular Oil Change services help keep your engine running smoothly."
                          ]
                        },
                        {
                          "tag": "alternator_warning_light",
                          "patterns": [
                            "The battery light is on",
                            "I got an alternator warning on my dashboard",
                            "Why is my battery warning light flashing?",
                            "My car shows a charging system error"
                          ],
                          "responses": [
                            "The alternator warning light signals a charging system issue. A Battery Replacement or Car Diagnostic Service is recommended to check the alternator and related components."
                          ]
                        },
                        {
                          "tag": "alternator_noise",
                          "patterns": [
                            "My alternator is making a whining noise",
                            "I hear a grinding sound from my engine",
                            "There’s a high-pitched squeal when I start the car",
                            "Why is my car making a whining noise?"
                          ],
                          "responses": [
                            "A whining or grinding noise could indicate a worn alternator bearing or belt. A Car Diagnostic Service can inspect and fix the issue."
                          ]
                        },
                        {
                          "tag": "alternator_failing",
                          "patterns": [
                            "I think my alternator is failing",
                            "My battery keeps dying even after replacing it",
                            "Why is my car losing power while driving?",
                            "My headlights dim when I accelerate",
                            "The dashboard lights flicker while driving"
                          ],
                          "responses": [
                            "A failing alternator can cause electrical issues, dim lights, and a weak battery. You may need a Battery Replacement or Car Diagnostic Service to confirm and fix the problem."
                          ]
                        },
                        {
                          "tag": "battery_not_charging",
                          "patterns": [
                            "My battery doesn’t charge while driving",
                            "I replaced my battery but the car still won’t start",
                            "I keep jump-starting my car, but it dies again",
                            "Why does my battery drain even after long drives?"
                          ],
                          "responses": [
                            "If your battery isn't charging while driving, the alternator may not be supplying enough power. A Battery Replacement or Car Diagnostic Service can help identify the issue."
                          ]
                        },
                        
                          {
                            "tag": "radiator_leaking",
                            "patterns": [
                              "I see coolant leaking from my car",
                              "My radiator is leaking",
                              "There’s a puddle of coolant under my car",
                              "Why is my car losing coolant?",
                              "My engine is overheating, could it be a radiator leak?"
                            ],
                            "responses": [
                              "A leaking radiator can cause your engine to overheat and lead to serious damage. You may need a Car Diagnostic Service to identify the leak and repair or replace the radiator."
                            ]
                          },
                          {
                            "tag": "coolant_low_warning",
                            "patterns": [
                              "My coolant level is always low",
                              "I keep refilling coolant, but it runs out quickly",
                              "Why does my coolant disappear so fast?",
                              "I got a low coolant warning on my dashboard"
                            ],
                            "responses": [
                              "A persistent low coolant level could be due to a radiator leak or a failing cooling system. A Car Diagnostic Service is recommended to inspect the radiator and hoses."
                            ]
                          },
                          {
                            "tag": "overheating_due_to_radiator",
                            "patterns": [
                              "My car is overheating",
                              "I see steam coming from my engine",
                              "Why is my temperature gauge so high?",
                              "My engine overheats when idling"
                            ],
                            "responses": [
                              "An overheating engine can result from a leaking or clogged radiator. A Car Diagnostic Service can help identify and fix the issue before it leads to engine damage."
                            ]
                          },
                          {
                            "tag": "radiator_cap_problem",
                            "patterns": [
                              "My radiator cap is loose",
                              "Coolant is spilling from my radiator",
                              "I hear a hissing sound near my radiator",
                              "Why is coolant leaking from the cap?"
                            ],
                            "responses": [
                              "A faulty radiator cap can cause coolant to leak or overheat. You may need a Car Diagnostic Service to check if the cap needs to be replaced."
                            ]
                          },
                          {
                            "tag": "rust_or_sediment_in_radiator",
                            "patterns": [
                              "My radiator has rust inside",
                              "There’s sludge in my coolant",
                              "Why does my coolant look dirty?",
                              "My heater isn’t working well, could it be the radiator?"
                            ],
                            "responses": [
                              "Rust or sludge buildup in the radiator can block coolant flow and cause overheating. A Car Diagnostic Service or an Engine Tune-Up may be needed to flush the system."
                            ]
                          },
                          
                              {
                                "tag": "starter_motor_failing",
                                "patterns": [
                                  "My car won’t start but the battery is fine",
                                  "I hear a clicking noise when I turn the key",
                                  "Why does my car take multiple tries to start?",
                                  "My engine doesn’t crank when I try to start the car",
                                  "I think my starter motor is broken"
                                ],
                                "responses": [
                                  "A failing starter motor can prevent your car from starting, even if the battery is working. You may need a Car Diagnostic Service or a Battery Replacement to confirm and fix the issue."
                                ]
                              },
                              {
                                "tag": "clicking_sound_when_starting",
                                "patterns": [
                                  "There’s a clicking sound when I turn the ignition",
                                  "My car just clicks but won’t start",
                                  "Why does my car make a clicking noise when I start it?",
                                  "I hear rapid clicking but the engine won’t turn over"
                                ],
                                "responses": [
                                  "A clicking sound often indicates a weak battery or a faulty starter motor. You may need a Battery Replacement or a Car Diagnostic Service to identify the problem."
                                ]
                              },
                              {
                                "tag": "engine_cranks_but_won’t_start",
                                "patterns": [
                                  "My engine cranks but won’t start",
                                  "I turn the key and the engine turns over but won’t start",
                                  "Why does my car crank but not start?",
                                  "My car struggles to start even though it cranks"
                                ],
                                "responses": [
                                  "If the engine cranks but won’t start, the issue could be with the starter motor, fuel system, or ignition system. A Car Diagnostic Service is recommended."
                                ]
                              },
                              {
                                "tag": "starter_motor_grinding_noise",
                                "patterns": [
                                  "My car makes a grinding noise when I try to start it",
                                  "I hear a loud screeching sound when I start the engine",
                                  "Why is my starter making a grinding noise?",
                                  "There’s a harsh noise coming from the engine when starting"
                                ],
                                "responses": [
                                  "A grinding noise when starting may indicate a worn-out starter motor or damaged flywheel. A Car Diagnostic Service can help determine the exact issue."
                                ]
                              },
                              {
                                "tag": "starter_motor_smoking",
                                "patterns": [
                                  "I see smoke coming from my engine when trying to start",
                                  "My car smells like burning when I turn the key",
                                  "Why is my starter motor overheating?",
                                  "My starter is smoking, what should I do?"
                                ],
                                "responses": [
                                  "Smoke from the starter motor could be a sign of electrical failure or overheating. A Car Diagnostic Service is needed to inspect and replace the faulty component."
                                ]
                              },
                              {
                                  "tag": "windscreen_cracks",
                                  "patterns": [
                                    "There are cracks in my windscreen",
                                    "I noticed a small crack on my windshield",
                                    "My windshield is chipped, what should I do?",
                                    "Why is my windscreen cracking?",
                                    "My windshield has a long crack, can it be fixed?"
                                  ],
                                  "responses": [
                                    "Cracks in the windscreen can spread over time and weaken visibility. You may need a Windshield Repair & Replacement service to fix or replace the glass."
                                  ]
                                },
                                {
                                  "tag": "windscreen_small_chip",
                                  "patterns": [
                                    "There’s a tiny chip on my windshield",
                                    "Can I drive with a chipped windscreen?",
                                    "My windshield has a small stone chip",
                                    "How do I stop my windshield chip from spreading?"
                                  ],
                                  "responses": [
                                    "A small chip can often be repaired before it turns into a large crack. A Windshield Repair & Replacement service can help fix it before it worsens."
                                  ]
                                },
                                {
                                  "tag": "windscreen_shattered",
                                  "patterns": [
                                    "My windshield is completely shattered",
                                    "I got into an accident, and my windscreen is broken",
                                    "Can I drive with a broken windshield?",
                                    "My windshield is in pieces, what should I do?"
                                  ],
                                  "responses": [
                                    "A shattered windshield is a serious safety hazard and should be replaced immediately. A Windshield Repair & Replacement service can install a new one for you."
                                  ]
                                },
                                {
                                  "tag": "windscreen_cracks_spreading",
                                  "patterns": [
                                    "My windscreen crack is getting bigger",
                                    "The crack in my windshield is spreading fast",
                                    "Why is my windshield crack expanding?",
                                    "How do I stop a windshield crack from growing?"
                                  ],
                                  "responses": [
                                    "Cracks can spread due to temperature changes and vibrations. A Windshield Repair & Replacement service can prevent further damage or replace it if necessary."
                                  ]
                                },
                                {
                                  "tag": "windscreen_visibility_issue",
                                  "patterns": [
                                    "I can’t see clearly through my cracked windshield",
                                    "Is it illegal to drive with a cracked windscreen?",
                                    "My windscreen crack is blocking my view",
                                    "The sun reflects off the crack, making it hard to see"
                                  ],
                                  "responses": [
                                    "A cracked windscreen can reduce visibility and safety while driving. You may need a Windshield Repair & Replacement service to restore clear vision."
                                  ]
                                },
                                {
                                  "tag": "excessive_exhaust_smoke",
                                  "patterns": [
                                    "My car is emitting too much smoke",
                                    "Why is my exhaust smoke so thick?",
                                    "There’s a lot of smoke coming from my tailpipe",
                                    "My car is giving out excessive emissions",
                                    "The exhaust is producing a strong smell"
                                  ],
                                  "responses": [
                                    "Excessive exhaust smoke can indicate an issue with the engine, fuel system, or catalytic converter. A Car Diagnostic Service can identify the cause and suggest necessary repairs."
                                  ]
                                },
                                {
                                  "tag": "black_exhaust_smoke",
                                  "patterns": [
                                    "Why is my car emitting black smoke?",
                                    "Black smoke is coming from my exhaust",
                                    "My fuel consumption is high, and my exhaust is black",
                                    "What causes black smoke from the tailpipe?",
                                    "There’s a burning smell and black smoke from my car"
                                  ],
                                  "responses": [
                                    "Black smoke often means the engine is burning too much fuel due to a faulty fuel injector or air filter. A Car Diagnostic Service or an Engine Tune-Up may be needed to fix this issue."
                                  ]
                                },
                                {
                                  "tag": "white_exhaust_smoke",
                                  "patterns": [
                                    "Why is my car producing white smoke?",
                                    "White smoke is coming from my exhaust",
                                    "My engine is overheating, and there’s white smoke",
                                    "What does white smoke from the tailpipe mean?",
                                    "There’s steam or white smoke coming out of my car"
                                  ],
                                  "responses": [
                                    "White smoke may indicate a coolant leak or a blown head gasket, leading to overheating. A Car Diagnostic Service can confirm the issue and recommend repairs."
                                  ]
                                },
                               
                                {
                                  "tag": "grey_exhaust_smoke",
                                  "patterns": [
                                    "Why is my exhaust smoke grey?",
                                    "My car is emitting grey smoke from the exhaust",
                                    "There’s a strong smell and grey smoke from my tailpipe",
                                    "What does grey smoke from the exhaust mean?",
                                    "I noticed thick grey emissions from my car"
                                  ],
                                  "responses": [
                                    "Grey smoke could indicate transmission fluid burning, a turbocharger problem, or excess oil consumption. A Car Diagnostic Service is recommended to determine the exact cause."
                                  ]
                                },
                                {
                                  "tag": "check_engine_light_on_emissions",
                                  "patterns": [
                                    "My check engine light is on and my car is emitting smoke",
                                    "Why does my car have excessive emissions and a warning light?",
                                    "My car smells bad, and the check engine light came on",
                                    "The engine light turned on after I noticed black smoke",
                                    "I think my emissions system is failing"
                                  ],
                                  "responses": [
                                    "Excessive emissions along with a check engine light may indicate a faulty oxygen sensor, catalytic converter, or fuel system issue. A Car Diagnostic Service can help diagnose and fix the problem."
                                  ]
                                },
                                {
                                  "tag": "sensor_malfunction",
                                  "patterns": [
                                    "My car sensors are not working properly",
                                    "Why are my car sensors failing?",
                                    "The parking sensors are malfunctioning",
                                    "Some of my vehicle sensors are giving wrong readings",
                                    "The sensors in my car are acting weird"
                                  ],
                                  "responses": [
                                    "Malfunctioning sensors can affect various systems in your car, from parking assistance to engine performance. A Car Diagnostic Service can detect and fix faulty sensors."
                                  ]
                                },
                                {
                                  "tag": "oxygen_sensor_issue",
                                  "patterns": [
                                    "Why is my oxygen sensor failing?",
                                    "My car’s oxygen sensor is giving incorrect readings",
                                    "The check engine light came on due to an O2 sensor issue",
                                    "How do I know if my oxygen sensor is faulty?",
                                    "The fuel efficiency has dropped, and my car smells bad"
                                  ],
                                  "responses": [
                                    "A faulty oxygen sensor can lead to poor fuel efficiency and increased emissions. A Car Diagnostic Service can identify and replace the faulty sensor."
                                  ]
                                },
                                {
                                  "tag": "map_sensor_issue",
                                  "patterns": [
                                    "My car’s MAP sensor is faulty",
                                    "What happens if the MAP sensor is not working?",
                                    "The engine performance is poor due to a bad MAP sensor",
                                    "Why is my car hesitating when I accelerate?",
                                    "The engine stalls when I try to speed up"
                                  ],
                                  "responses": [
                                    "A malfunctioning MAP sensor can cause poor acceleration and stalling. A Car Diagnostic Service can check and replace the sensor if needed."
                                  ]
                                },
                                {
                                  "tag": "maf_sensor_issue",
                                  "patterns": [
                                    "The MAF sensor is not working properly",
                                    "Why does my car struggle to start due to a bad MAF sensor?",
                                    "The fuel economy has dropped, and my car is sluggish",
                                    "How do I know if my mass airflow sensor is faulty?",
                                    "The engine is running rough and consuming too much fuel"
                                  ],
                                  "responses": [
                                    "A faulty MAF sensor can lead to rough engine performance and high fuel consumption. A Car Diagnostic Service or an Engine Tune-Up may be needed to fix this."
                                  ]
                                },
                                {
                                  "tag": "crankshaft_sensor_issue",
                                  "patterns": [
                                    "My car won’t start because of a crankshaft sensor problem",
                                    "What happens if my crankshaft sensor is bad?",
                                    "The engine stalls randomly, could it be the crankshaft sensor?",
                                    "Why is my car misfiring due to a bad crank sensor?",
                                    "My vehicle takes too long to start"
                                  ],
                                  "responses": [
                                    "A faulty crankshaft sensor can cause starting issues and engine misfires. A Car Diagnostic Service can check and replace the sensor if needed."
                                  ]
                                },
                                {
                                  "tag": "throttle_position_sensor_issue",
                                  "patterns": [
                                    "The throttle response is delayed in my car",
                                    "Why is my throttle position sensor failing?",
                                    "My car is jerking when I accelerate",
                                    "The engine revs up unexpectedly",
                                    "How do I fix a faulty throttle position sensor?"
                                  ],
                                  "responses": [
                                    "A bad throttle position sensor can cause acceleration problems and poor fuel efficiency. A Car Diagnostic Service can diagnose and replace the sensor if needed."
                                  ]
                                },
                                {
                                  "tag": "wheel_speed_sensor_issue",
                                  "patterns": [
                                    "My ABS light is on due to a bad wheel speed sensor",
                                    "Why is my speedometer not working?",
                                    "The traction control system is failing due to a sensor problem",
                                    "My car skids when braking, could it be the wheel speed sensor?",
                                    "How do I fix a faulty wheel speed sensor?"
                                  ],
                                  "responses": [
                                    "A bad wheel speed sensor can affect ABS and traction control. A Brake Inspection & Repair service can help diagnose and replace the faulty sensor."
                                  ]
                                },
                                {
                                  "tag": "transmission_slipping",
                                  "patterns": [
                                    "Why is my transmission slipping?",
                                    "My car struggles to change gears",
                                    "The transmission slips while driving",
                                    "Why does my car lose power when shifting gears?",
                                    "The RPM increases, but my speed doesn’t"
                                  ],
                                  "responses": [
                                    "A slipping transmission can be caused by low fluid levels, worn-out gears, or a failing clutch. A Car Diagnostic Service can help detect the issue and recommend repairs."
                                  ]
                                },
                                {
                                  "tag": "hard_shifting",
                                  "patterns": [
                                    "Why is my car shifting gears roughly?",
                                    "It’s hard to change gears in my car",
                                    "My automatic transmission is jerking",
                                    "The gear shifts feel very rough",
                                    "Why does my car clunk when changing gears?"
                                  ],
                                  "responses": [
                                    "Hard shifting can be due to transmission fluid issues, sensor malfunctions, or worn-out components. A Car Diagnostic Service can help identify and fix the problem."
                                  ]
                                },
                                {
                                  "tag": "delayed_gear_engagement",
                                  "patterns": [
                                    "Why does my car take time to go into gear?",
                                    "There’s a delay when I shift from park to drive",
                                    "My car hesitates before moving after shifting gears",
                                    "The transmission doesn’t engage immediately",
                                    "Why does my automatic transmission take time to respond?"
                                  ],
                                  "responses": [
                                    "Delayed gear engagement can be caused by low transmission fluid, a faulty solenoid, or internal damage. A Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "grinding_noise_transmission",
                                  "patterns": [
                                    "Why does my car make a grinding noise when shifting gears?",
                                    "I hear a grinding sound when I change gears",
                                    "My manual transmission makes a strange noise",
                                    "The transmission is making loud noises",
                                    "What causes grinding sounds in the gearbox?"
                                  ],
                                  "responses": [
                                    "Grinding noises can indicate worn-out gears, low transmission fluid, or clutch problems. A Car Diagnostic Service can identify the issue and suggest repairs."
                                  ]
                                },
                                {
                                  "tag": "gearbox_fluid_leak",
                                  "patterns": [
                                    "Why is my car leaking transmission fluid?",
                                    "There’s red fluid under my car",
                                    "I think my gearbox is leaking",
                                    "How do I know if my transmission is leaking?",
                                    "My car is low on transmission fluid frequently"
                                  ],
                                  "responses": [
                                    "A transmission fluid leak can cause serious damage to your gearbox. A Car Diagnostic Service can locate the leak and perform necessary repairs."
                                  ]
                                },
                                {
                                  "tag": "stuck_in_one_gear",
                                  "patterns": [
                                    "My car is stuck in one gear",
                                    "Why won’t my car shift gears?",
                                    "The transmission won’t go into drive",
                                    "My automatic gearbox is not shifting",
                                    "The gear shifter is stuck"
                                  ],
                                  "responses": [
                                    "A stuck transmission could be due to a faulty solenoid, damaged linkage, or a computer issue. A Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "burning_smell_transmission",
                                  "patterns": [
                                    "Why does my car smell like something is burning?",
                                    "I smell something burning when driving",
                                    "My car smells bad after long drives",
                                    "Could my transmission be overheating?",
                                    "There’s a burnt smell when I shift gears"
                                  ],
                                  "responses": [
                                    "A burning smell from the transmission could mean overheating fluid or worn-out components. A Car Diagnostic Service can inspect and fix the issue."
                                  ]
                                },
                                {
                                  "tag": "transmission_fluid_leak",
                                  "patterns": [
                                    "Why is my transmission fluid leaking?",
                                    "I see red fluid under my car",
                                    "How do I fix a transmission fluid leak?",
                                    "My car is losing transmission fluid",
                                    "There’s a puddle of fluid under my vehicle",
                                    "Why is my gearbox leaking fluid?"
                                  ],
                                  "responses": [
                                    "Transmission fluid leaks can be caused by a worn-out gasket, damaged seals, or a cracked transmission pan. Driving with low fluid can lead to severe gearbox damage. A Car Diagnostic Service can locate the leak and perform necessary repairs."
                                  ]
                                },
                                {
                                  "tag": "automatic_transmission_slipping",
                                  "patterns": [
                                    "Why is my automatic transmission slipping?",
                                    "My car struggles to change gears",
                                    "The transmission slips while driving",
                                    "Why does my car lose power when shifting gears?",
                                    "The RPM increases, but my speed doesn’t",
                                    "My automatic gearbox isn't engaging properly"
                                  ],
                                  "responses": [
                                    "A slipping automatic transmission can be caused by low transmission fluid, worn-out clutch plates, or a failing torque converter. Ignoring this can lead to costly repairs. A Car Diagnostic Service is recommended to inspect and fix the issue."
                                  ]
                                },
                                {
                                  "tag": "manual_transmission_slipping",
                                  "patterns": [
                                    "Why is my manual transmission slipping?",
                                    "My clutch is slipping",
                                    "I lose power when shifting gears",
                                    "The RPM increases but my car doesn’t speed up",
                                    "Why does my manual car struggle to accelerate?"
                                  ],
                                  "responses": [
                                    "A slipping manual transmission is often due to a worn-out clutch, low transmission fluid, or pressure plate issues. Driving with a slipping clutch can cause further damage. A Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "manual_transmission_hard_shifting",
                                  "patterns": [
                                    "Why is it hard to shift gears in my manual car?",
                                    "My manual gearbox feels stiff",
                                    "I struggle to change gears in my car",
                                    "Why does my stick shift feel rough?",
                                    "My manual transmission makes a clunking noise when shifting"
                                  ],
                                  "responses": [
                                    "Hard shifting in a manual car can be caused by worn-out synchronizers, clutch issues, or low transmission fluid. A Car Diagnostic Service can identify and fix the problem."
                                  ]
                                },
                                {
                                  "tag": "manual_transmission_grinding_noise",
                                  "patterns": [
                                    "Why does my manual transmission make a grinding noise?",
                                    "I hear grinding when shifting gears",
                                    "My car makes a grinding sound when I change gears",
                                    "Why does my gearbox sound rough?",
                                    "What causes grinding in a manual transmission?"
                                  ],
                                  "responses": [
                                    "Grinding noises in a manual transmission could indicate worn-out synchronizers, a failing clutch, or low fluid levels. A Car Diagnostic Service is needed to prevent further damage."
                                  ]
                                },
                                {
                                  "tag": "manual_transmission_stuck_gear",
                                  "patterns": [
                                    "Why is my car stuck in one gear?",
                                    "I can't shift gears in my manual car",
                                    "My gear shifter is stuck",
                                    "Why won’t my manual gearbox go into gear?",
                                    "My transmission is locked in one position"
                                  ],
                                  "responses": [
                                    "A stuck manual transmission can be caused by a failing clutch master cylinder, damaged shift linkage, or internal gearbox issues. A Car Diagnostic Service can help fix the problem."
                                  ]
                                },
                                {
                                  "tag": "clogged_transmission_filters",
                                  "patterns": [
                                    "Why is my transmission not shifting properly?",
                                    "Can a clogged transmission filter cause shifting problems?",
                                    "My transmission feels sluggish",
                                    "Why does my car hesitate when changing gears?",
                                    "The transmission jerks when I drive",
                                    "I think my transmission filter is clogged"
                                  ],
                                  "responses": [
                                    "A clogged transmission filter can restrict fluid flow, leading to sluggish shifting, overheating, and potential gearbox damage. It’s recommended to schedule a Car Diagnostic Service to inspect and replace the filter if needed."
                                  ]
                                },
                                {
                                  "tag": "water_in_transmission",
                                  "patterns": [
                                    "How did water get into my transmission?",
                                    "Why is my transmission fluid milky?",
                                    "Can water damage my transmission?",
                                    "I drove through a flood, and now my transmission is acting up",
                                    "My car is shifting weird after water exposure",
                                    "There’s moisture in my transmission fluid",
                                    "My transmission is slipping after heavy rain",
                                    "How do I know if water got into my gearbox?",
                                    "The gears are not engaging properly after water exposure",
                                    "My car is making grinding noises after driving through water",
                                    "I accidentally pressure-washed my engine bay, and now my transmission is malfunctioning",
                                    "There’s a white foamy substance in my transmission fluid",
                                    "My transmission overheats after driving through deep water",
                                    "Why does my car struggle to accelerate after a flood?",
                                    "I hear a whining noise from my transmission after water exposure"
                                  ],
                                  "responses": [
                                    "Water in the transmission system can cause serious damage by contaminating the fluid, reducing lubrication, and leading to slipping, overheating, or gear failure. Immediate action is required to flush and replace the fluid. A Car Diagnostic Service is highly recommended."
                                  ]
                                },
                                {
                                  "tag": "car_speaker_issues",
                                  "patterns": [
                                    "Why are my car speakers not working?",
                                    "One of my car speakers stopped working",
                                    "Why do my speakers sound distorted?",
                                    "My car speakers crackle when playing music",
                                    "No sound from my car stereo",
                                    "Why is there static noise in my speakers?",
                                    "My speakers only work on one side",
                                    "Why do my speakers cut out randomly?",
                                    "There is a buzzing noise in my car speakers",
                                    "My subwoofer is not working in my car",
                                    "Why do my car speakers sound weak?",
                                    "I hear popping sounds from my car speakers",
                                    "My speakers are making a humming noise",
                                    "Only my front speakers are working",
                                    "Why do my rear speakers have no sound?",
                                    "My speakers sound muffled",
                                    "My Bluetooth audio sounds bad in my car",
                                    "My speakers are working but the volume is very low",
                                    "Why do my speakers make a high-pitched noise?"
                                  ],
                                  "responses": [
                                    "Car speaker issues can be caused by faulty wiring, a blown speaker, a bad head unit, or signal interference. If the issue persists, consider scheduling a Car Diagnostic Service to inspect the audio system."
                                  ]
                                },
                                {
                                  "tag": "headlights_not_working",
                                  "patterns": [
                                    "Why are my headlights not turning on?",
                                    "Both of my headlights are out",
                                    "My headlights don’t work even after changing the bulbs",
                                    "Why do my headlights work sometimes and not other times?",
                                    "My headlights went out while driving"
                                  ],
                                  "responses": [
                                    "Your headlights may not be working due to a blown fuse, faulty headlight relay, or a bad wiring connection. A Car Diagnostic Service can identify the exact issue."
                                  ]
                                },
                                {
                                  "tag": "one_headlight_out",
                                  "patterns": [
                                    "One of my headlights is not working",
                                    "Why is only one headlight working?",
                                    "My left/right headlight went out",
                                    "I replaced the bulb, but my headlight still won’t turn on"
                                  ],
                                  "responses": [
                                    "If only one headlight is out, the bulb might be burnt out, or there could be a wiring issue. Try replacing the bulb, and if the issue persists, a Car Diagnostic Service can help."
                                  ]
                                },
                                {
                                  "tag": "headlights_flickering",
                                  "patterns": [
                                    "Why do my headlights flicker while driving?",
                                    "My headlights keep flashing on and off",
                                    "Both my headlights flicker randomly",
                                    "Why do my lights dim and brighten on their own?"
                                  ],
                                  "responses": [
                                    "Flickering headlights can be caused by a weak battery, a failing alternator, or loose wiring. A Battery Replacement or Car Diagnostic Service can help diagnose and fix the issue."
                                  ]
                                },
                                {
                                  "tag": "brake_lights_not_working",
                                  "patterns": [
                                    "Why are my brake lights not working?",
                                    "None of my brake lights turn on",
                                    "My brake lights don’t work but my headlights do",
                                    "Pressing the brake doesn’t turn on the lights"
                                  ],
                                  "responses": [
                                    "Brake light failure can be due to a burnt-out bulb, a faulty brake light switch, or a fuse issue. A Car Diagnostic Service can identify and fix the problem."
                                  ]
                                },
                                {
                                  "tag": "brake_lights_stuck_on",
                                  "patterns": [
                                    "Why are my brake lights stuck on?",
                                    "My brake lights won’t turn off",
                                    "Even when I turn off my car, the brake lights stay on"
                                  ],
                                  "responses": [
                                    "If your brake lights stay on, the brake light switch might be stuck or faulty. A Car Diagnostic Service is recommended to fix this issue."
                                  ]
                                },
                                {
                                  "tag": "turn_signals_blinking_fast",
                                  "patterns": [
                                    "Why are my turn signals blinking too fast?",
                                    "My indicators flash rapidly",
                                    "My signal lights blink faster than usual"
                                  ],
                                  "responses": [
                                    "Fast-blinking turn signals usually indicate a burnt-out bulb or a bad relay. Try replacing the bulb, or schedule a Car Diagnostic Service if the issue continues."
                                  ]
                                },
                                {
                                  "tag": "turn_signals_not_blinking",
                                  "patterns": [
                                    "Why are my turn signals not working?",
                                    "My turn signals don’t blink",
                                    "The turn signal switch does nothing"
                                  ],
                                  "responses": [
                                    "If your turn signals are not blinking, it could be due to a bad flasher relay, a fuse issue, or a faulty switch. A Car Diagnostic Service can pinpoint the issue."
                                  ]
                                },
                                {
                                  "tag": "dashboard_lights_dim",
                                  "patterns": [
                                    "Why are my dashboard lights so dim?",
                                    "I can’t see my dashboard at night",
                                    "My instrument panel lights are too dark"
                                  ],
                                  "responses": [
                                    "Dim dashboard lights may be caused by a bad dimmer switch, failing alternator, or electrical issues. A Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "interior_lights_not_working",
                                  "patterns": [
                                    "Why are my interior lights not turning on?",
                                    "None of my car’s interior lights work",
                                    "My dome light won’t turn on"
                                  ],
                                  "responses": [
                                    "Interior light failure can be due to a blown fuse, a bad door switch, or a wiring issue. A Car Diagnostic Service can help troubleshoot the problem."
                                  ]
                                },
                                {
                                  "tag": "reverse_lights_not_working",
                                  "patterns": [
                                    "Why are my reverse lights not working?",
                                    "My backup lights won’t turn on",
                                    "I put my car in reverse but the lights don’t work"
                                  ],
                                  "responses": [
                                    "Reverse lights might not work due to a burnt-out bulb, faulty reverse light switch, or wiring problems. A Car Diagnostic Service can help fix the issue."
                                  ]
                                },
                                {
                                  "tag": "fog_lights_not_working",
                                  "patterns": [
                                    "Why are my fog lights not turning on?",
                                    "My fog lights don’t work",
                                    "I press the fog light button, but nothing happens"
                                  ],
                                  "responses": [
                                    "Fog lights may not work due to a bad fuse, faulty switch, or wiring issue. A Car Diagnostic Service is recommended to fix this problem."
                                  ]
                                },
                                {
                                  "tag": "headlights_cloudy_or_yellow",
                                  "patterns": [
                                    "Why do my headlights look yellow?",
                                    "My headlights are cloudy and dim",
                                    "My headlights are foggy and don’t shine bright"
                                  ],
                                  "responses": [
                                    "Cloudy or yellow headlights are caused by oxidation. Try a headlight restoration kit, or schedule a Car Diagnostic Service for a professional cleaning."
                                  ]
                                },
                                {
                                  "tag": "tail_lights_not_working",
                                  "patterns": [
                                    "Why are my tail lights not working?",
                                    "My brake lights work but my tail lights don’t",
                                    "Only my headlights turn on, not my rear lights"
                                  ],
                                  "responses": [
                                    "Tail light failure can be due to a blown fuse, bad wiring, or a faulty light switch. A Car Diagnostic Service can identify and fix the issue."
                                  ]
                                },
                                {
                                  "tag": "hazard_lights_not_working",
                                  "patterns": [
                                    "Why are my hazard lights not flashing?",
                                    "My emergency lights don’t work",
                                    "I press the hazard button but nothing happens"
                                  ],
                                  "responses": [
                                    "Hazard lights may not work due to a blown fuse, bad flasher relay, or a faulty switch. A Car Diagnostic Service can help resolve the issue."
                                  ]
                                },
                                {
                                  "tag": "license_plate_lights_not_working",
                                  "patterns": [
                                    "Why are my license plate lights not working?",
                                    "My plate lights are out",
                                    "How do I fix my license plate lights?"
                                  ],
                                  "responses": [
                                    "License plate lights might be out due to a burnt-out bulb or wiring issue. Try replacing the bulb, or schedule a Car Diagnostic Service for further inspection."
                                  ]
                                },
                                
                                {
                                  "tag": "hot_weather_battery_problems",
                                  "patterns": [
                                    "Does hot weather drain my battery faster?",
                                    "Why did my battery die in the heat?",
                                    "My car won’t start after sitting in the sun",
                                    "The heat is killing my battery, what should I do?"
                                  ],
                                  "responses": [
                                    "High temperatures can cause battery fluid to evaporate, leading to a dead battery. Regular maintenance and keeping your car in the shade can help. A Battery Test is recommended."
                                  ]
                                },
  
                                {
                                  "tag": "new_battery_but_car_wont_start",
                                  "patterns": [
                                    "I replaced my battery, but my car still won’t start",
                                    "Why won’t my car start with a new battery?",
                                    "I installed a new battery, but my engine won’t turn over",
                                    "My new battery isn’t working, what’s wrong?"
                                  ],
                                  "responses": [
                                    "If your car won’t start after installing a new battery, the issue might be with the alternator, starter motor, or a bad ground connection. A Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "car_only_starts_with_jump_start",
                                  "patterns": [
                                    "My car only starts when I jump-start it",
                                    "Why does my car need a jump start every time?",
                                    "I replaced my battery, but my car still needs a jump",
                                    "My battery dies every time I turn off the engine"
                                  ],
                                  "responses": [
                                    "If your car only starts with a jump, your battery might not be holding a charge or your alternator isn’t charging it. A Battery or Alternator Check is recommended."
                                  ]
                                },
                                {
                                  "tag": "car_died_while_driving",
                                  "patterns": [
                                    "Why did my car shut off while driving?",
                                    "My car lost power suddenly, is it the battery?",
                                    "The dashboard lights went out and my car stopped",
                                    "My engine died on the road, could it be a battery problem?"
                                  ],
                                  "responses": [
                                    "If your car shuts off while driving, it could be a failing alternator or battery. A Car Diagnostic Service is recommended to check the electrical system."
                                  ]
                                },
                                {
                                  "tag": "car_battery_swollen",
                                  "patterns": [
                                    "Why does my car battery look swollen?",
                                    "My battery case is bulging, is it dangerous?",
                                    "Is a swollen battery a sign of failure?",
                                    "My car battery expanded, should I replace it?"
                                  ],
                                  "responses": [
                                    "A swollen battery is dangerous and should be replaced immediately. It can be caused by overcharging or extreme temperatures. A Battery Replacement is required."
                                  ]
                                },
                                {
                                  "tag": "car_paint_scratches",
                                  "patterns": [
                                    "How do I remove scratches from my car?",
                                    "My car got scratched, how can I fix it?",
                                    "There are deep scratches on my car paint",
                                    "Can I fix car scratches at home?",
                                    "What’s the best way to repair a scratch on my car?"
                                  ],
                                  "responses": [
                                    "The method to fix scratches depends on their depth. Light scratches can be buffed out with scratch remover, while deeper ones may require touch-up paint or professional repair."
                                  ]
                                },
                                {
                                  "tag": "paint_fading_or_peeling",
                                  "patterns": [
                                    "Why is my car paint fading?",
                                    "My car’s paint is peeling, what should I do?",
                                    "The clear coat on my car is coming off",
                                    "How can I stop my car’s paint from fading?",
                                    "What causes car paint to peel?"
                                  ],
                                  "responses": [
                                    "Paint fading or peeling can be due to sun exposure, oxidation, or poor-quality paint. Regular waxing and using car covers can help prevent it. A professional paint job may be needed for severe cases."
                                  ]
                                },
                                {
                                  "tag": "car_rust_issues",
                                  "patterns": [
                                    "How do I stop rust on my car?",
                                    "There’s rust forming on my car’s body",
                                    "What’s the best way to remove rust from a car?",
                                    "Why is my car rusting?",
                                    "Can I fix car rust at home?"
                                  ],
                                  "responses": [
                                    "Rust forms due to moisture and exposure to air. Removing rust early with sandpaper and applying rust-resistant paint can prevent further damage. Severe rust may require professional repair."
                                  ]
                                },
                                {
                                  "tag": "wipers_streaking_or_not_clearing",
                                  "patterns": [
                                    "Why do my wipers leave streaks?",
                                    "My windshield wipers aren’t clearing properly",
                                    "How do I fix streaky wipers?",
                                    "Why are my wipers smearing water instead of clearing it?",
                                    "What’s the best way to clean wiper blades?"
                                  ],
                                  "responses": [
                                    "Streaking wipers can be caused by dirt, worn-out rubber, or a damaged windshield. Try cleaning the blades with a damp cloth or replace them if they are old."
                                  ]
                                },
                                {
                                  "tag": "wiper_blades_making_noise",
                                  "patterns": [
                                    "Why do my windshield wipers make a squeaking noise?",
                                    "My wipers are noisy, how do I fix them?",
                                    "How can I stop my wipers from making noise?",
                                    "My wipers are chattering on the glass, what should I do?"
                                  ],
                                  "responses": [
                                    "Noisy wipers can be caused by worn-out blades, dirt buildup, or a dry windshield. Try cleaning them or applying a rubber conditioner. If the noise continues, replace the blades."
                                  ]
                                },
                                {
                                  "tag": "scratches_on_windshield",
                                  "patterns": [
                                    "How do I remove scratches from my windshield?",
                                    "My windshield has small scratches, can I fix them?",
                                    "Why does my windshield have scratch marks?",
                                    "Can I polish my windshield to remove scratches?"
                                  ],
                                  "responses": [
                                    "Small scratches on windshields can be removed with glass polish or a DIY repair kit. Deep scratches may require professional glass repair or replacement."
                                  ]
                                },
                                {
                                  "tag": "chipped_paint_from_road_debris",
                                  "patterns": [
                                    "Why does my car have small paint chips?",
                                    "How do I fix chipped paint on my car?",
                                    "My car’s paint is chipping from rocks and debris",
                                    "Can I touch up small paint chips myself?"
                                  ],
                                  "responses": [
                                    "Small paint chips from road debris can be fixed using a touch-up paint kit. For larger chips, a professional repainting job may be needed."
                                  ]
                                },
                                {
                                  "tag": "power_window_not_working",
                                  "patterns": [
                                    "Why won’t my power windows roll up?",
                                    "My power window is stuck, what should I do?",
                                    "Only one of my power windows is working",
                                    "The driver’s side window isn’t moving",
                                    "What causes power windows to stop working?"
                                  ],
                                  "responses": [
                                    "Power windows may stop working due to a faulty switch, bad motor, blown fuse, or wiring issue. Try checking the fuse box first. If the problem persists, you may need a Car Diagnostic Service."
                                  ]
                                },
                                {
                                  "tag": "window_moving_slowly",
                                  "patterns": [
                                    "Why is my car window rolling up so slowly?",
                                    "My power window is struggling to go up",
                                    "The window moves but is very slow",
                                    "What causes slow-moving power windows?",
                                    "How can I fix a slow car window?"
                                  ],
                                  "responses": [
                                    "A slow-moving window can be caused by dirt buildup in the tracks, a weak motor, or lack of lubrication. Cleaning and lubricating the window tracks might help. If not, a Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "manual_window_not_rolling",
                                  "patterns": [
                                    "My manual window is stuck",
                                    "Why won’t my crank window roll down?",
                                    "The window crank is spinning but the window isn’t moving",
                                    "How do I fix a stuck manual window?",
                                    "My manual window only moves halfway, what should I do?"
                                  ],
                                  "responses": [
                                    "Manual windows can get stuck due to a broken regulator, worn gears, or a jammed track. Try lubricating the track or checking for obstructions. If the problem continues, you may need a Car Diagnostic Service."
                                  ]
                                },
                                {
                                  "tag": "window_falling_down",
                                  "patterns": [
                                    "Why does my car window keep falling down?",
                                    "My window won’t stay up, what’s wrong?",
                                    "The glass falls when I try to roll the window up",
                                    "Why is my window sliding down on its own?",
                                    "How do I fix a window that won’t stay closed?"
                                  ],
                                  "responses": [
                                    "A falling window is often caused by a broken regulator, worn-out clips, or a detached cable. It’s best to avoid using the window until it’s repaired. You may need a Car Diagnostic Service."
                                  ]
                                },
                                {
                                  "tag": "window_making_noise",
                                  "patterns": [
                                    "Why does my car window make noise when rolling up?",
                                    "There’s a grinding sound when I use my power window",
                                    "My window makes a clicking noise when I open it",
                                    "Why is my car window making a squeaky sound?",
                                    "How do I stop my power window from making noise?"
                                  ],
                                  "responses": [
                                    "Noisy windows can be due to a dry track, worn gears, or a failing window motor. Try lubricating the window track. If the noise continues, a Car Diagnostic Service may be needed."
                                  ]
                                },
                                {
                                  "tag": "window_stuck_in_cold_weather",
                                  "patterns": [
                                    "Why won’t my window move in cold weather?",
                                    "My car window is frozen shut",
                                    "How do I unfreeze a stuck car window?",
                                    "The window motor is working, but the glass won’t move",
                                    "What should I do if my power window is frozen?"
                                  ],
                                  "responses": [
                                    "Cold weather can cause moisture to freeze around the window seals. Try using a de-icer spray or warm air to thaw the ice. Avoid forcing the window, as it may damage the motor. If the issue persists, a Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "window_not_closing_completely",
                                  "patterns": [
                                    "My car window won’t fully close",
                                    "Why is there a gap when my window is rolled up?",
                                    "How do I fix a window that won’t seal properly?",
                                    "My power window stops before closing all the way",
                                    "What causes a window to not close completely?"
                                  ],
                                  "responses": [
                                    "A window that won’t fully close may have misaligned tracks, an obstructed seal, or a faulty motor. Try gently pushing it while operating the switch. If that doesn’t work, a Car Diagnostic Service is recommended."
                                  ]
                                },
                                {
                                  "tag": "water_leaking_through_window",
                                  "patterns": [
                                    "Why is water leaking through my car window?",
                                    "My window seals are leaking",
                                    "How do I fix a leaky window seal?",
                                    "There’s water inside my car after it rains",
                                    "What causes water to leak through car windows?"
                                  ],
                                  "responses": [
                                    "Water leaks can be due to worn-out rubber seals, clogged drain channels, or misaligned windows. Cleaning the seals and applying weatherproofing can help. If the problem persists, a Windshield Repair & Replacement service may be needed."
                                  ]
                                },
                                {
                                  "tag": "window_tinted_film_peeling",
                                  "patterns": [
                                    "Why is my window tint peeling off?",
                                    "How do I fix peeling window tint?",
                                    "The tint film on my window is bubbling",
                                    "What causes window tint to peel?",
                                    "Can I replace my window tint at home?"
                                  ],
                                  "responses": [
                                    "Peeling window tint is caused by sun exposure, poor application, or aging adhesive. Small bubbles can be smoothed out with heat, but a full replacement may be needed. A professional repair service is recommended."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_clicks_but_does_not_start",
                                  "patterns": [
                                    "Why does my car make a clicking noise but won’t start?",
                                    "I hear clicking sounds when I turn the key, but the engine won’t start",
                                    "What causes a clicking sound when starting the car?",
                                    "Why won’t my car start even though I hear a click?",
                                    "My car clicks but doesn’t crank, what’s wrong?"
                                  ],
                                  "responses": [
                                    "A clicking noise usually means the starter solenoid is trying to engage but isn’t getting enough power. This could be due to a weak battery, corroded connections, or a failing starter motor. You may need a Battery Replacement or a Car Diagnostic Service."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_not_responding",
                                  "patterns": [
                                    "Why does my car do nothing when I turn the key?",
                                    "I turn the key and nothing happens",
                                    "My car won’t crank or make any noise when I start it",
                                    "Why is my car silent when I try to start it?",
                                    "How do I fix a car that doesn’t respond to the ignition?"
                                  ],
                                  "responses": [
                                    "If your car doesn’t make any noise when you turn the key, it could be a dead battery, a faulty ignition switch, or a completely failed starter motor. A Battery Replacement or Car Diagnostic Service may be needed."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_grinds",
                                  "patterns": [
                                    "Why is there a grinding noise when I start my car?",
                                    "My starter makes a grinding sound, what’s wrong?",
                                    "What causes grinding when starting a car?",
                                    "I hear a loud grinding noise from the engine when turning the key",
                                    "Why is my starter motor making a scraping noise?"
                                  ],
                                  "responses": [
                                    "A grinding noise often means the starter gear isn’t properly engaging with the flywheel. This could be due to worn-out starter gears or a damaged flywheel. Ignoring this could lead to costly repairs. You may need a Car Diagnostic Service."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_engages_but_engine_does_not_turn",
                                  "patterns": [
                                    "Why does my starter spin but the engine doesn’t turn?",
                                    "I hear the starter motor running, but the engine won’t start",
                                    "What causes a starter motor to run but not crank the engine?",
                                    "My starter is working, but the engine won’t fire up",
                                    "Why does my car just hum when I try to start it?"
                                  ],
                                  "responses": [
                                    "If the starter motor spins but the engine doesn’t turn over, the issue could be a faulty starter drive or a disengaged flywheel. It’s best to get a Car Diagnostic Service to inspect the starter system."
                                  ]
                                },
                                {
                                  "tag": "car_only_starts_sometimes",
                                  "patterns": [
                                    "Why does my car start sometimes but not always?",
                                    "My car randomly won’t start, what’s causing this?",
                                    "The starter works sometimes but not always, what’s the issue?",
                                    "Why does my car have an intermittent starting problem?",
                                    "What causes a car to start one day and not the next?"
                                  ],
                                  "responses": [
                                    "Intermittent starting can be due to a failing starter relay, loose wiring, or a weak battery connection. If your car starts unpredictably, it’s best to schedule a Car Diagnostic Service before the issue worsens."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_keeps_running",
                                  "patterns": [
                                    "Why does my starter keep running after the car starts?",
                                    "My starter motor won’t turn off, what’s wrong?",
                                    "What causes a starter to stay engaged?",
                                    "Why is my starter still running even after I release the key?",
                                    "How do I stop my starter motor from running constantly?"
                                  ],
                                  "responses": [
                                    "If your starter motor keeps running after starting the engine, it could be a stuck solenoid, a faulty ignition switch, or a short circuit. This can cause severe damage, so a Car Diagnostic Service is recommended immediately."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_smells_burnt",
                                  "patterns": [
                                    "Why does my starter motor smell like burning?",
                                    "I smell something burning when I try to start my car",
                                    "My starter motor is overheating, what’s wrong?",
                                    "What causes a burnt smell from the starter?",
                                    "How do I fix a burning starter motor?"
                                  ],
                                  "responses": [
                                    "A burning smell from the starter may indicate overheating due to excessive cranking, a failing starter, or an electrical short. Avoid trying to start the car repeatedly, and schedule a Car Diagnostic Service immediately."
                                  ]
                                },
                                {
                                  "tag": "starter_motor_engages_but_immediately_disengages",
                                  "patterns": [
                                    "Why does my starter motor start and then stop?",
                                    "My starter engages but doesn’t stay running",
                                    "What causes a starter motor to disengage too soon?",
                                    "Why does my car try to start and then stop?",
                                    "The starter motor runs briefly but stops before the engine starts"
                                  ],
                                  "responses": [
                                    "This issue is usually caused by a faulty starter solenoid, a weak battery, or an ignition switch problem. A Battery Replacement or Car Diagnostic Service may be required."
                                  ]
                                },
                                {
                                  "tag": "rust_on_car_body",
                                  "patterns": [
                                    "Why is my car body rusting?",
                                    "How do I remove rust from my car’s body?",
                                    "There are rust spots on my car, what should I do?",
                                    "What causes rust to form on a car’s exterior?",
                                    "My car is rusting near the doors and fenders, how can I fix it?"
                                  ],
                                  "responses": [
                                    "Rust on the car body is caused by prolonged exposure to moisture, road salt, and environmental factors. You can remove surface rust with sandpaper and touch-up paint, but extensive rust may require professional bodywork."
                                  ]
                                },
                                {
                                  "tag": "rust_on_car_frame",
                                  "patterns": [
                                    "How dangerous is rust on a car frame?",
                                    "Can a rusted car frame be repaired?",
                                    "My car’s undercarriage has rust, is it safe to drive?",
                                    "What should I do if my car frame has rust?",
                                    "How do I stop my car frame from rusting?"
                                  ],
                                  "responses": [
                                    "Rust on a car frame can weaken structural integrity and become a safety hazard. Small areas can be treated with rust inhibitors, but severe rust may require welding or frame replacement. A professional inspection is recommended."
                                  ]
                                },
                                {
                                  "tag": "rust_on_brake_lines",
                                  "patterns": [
                                    "Can rust damage brake lines?",
                                    "Why are my brake lines rusting?",
                                    "My mechanic said my brake lines have rust, should I be worried?",
                                    "What causes rust on brake lines?",
                                    "How do I prevent my brake lines from rusting?"
                                  ],
                                  "responses": [
                                    "Rust on brake lines can weaken them, leading to dangerous brake failure. If you notice rust, have the brake lines inspected immediately. Replacing rusted brake lines is the safest option."
                                  ]
                                },
                                {
                                  "tag": "rust_on_wheel_wells",
                                  "patterns": [
                                    "Why is there rust around my wheel wells?",
                                    "How do I remove rust from my wheel arches?",
                                    "What causes rust inside my wheel wells?",
                                    "How can I stop my wheel wells from rusting?",
                                    "My car’s fenders are rusting, what should I do?"
                                  ],
                                  "responses": [
                                    "Rust in wheel wells is caused by dirt, moisture, and road salt accumulating in hidden areas. Regular cleaning, rust-proofing spray, and touch-up paint can help prevent further damage."
                                  ]
                                },
                                {
                                  "tag": "rust_on_exhaust_pipe",
                                  "patterns": [
                                    "Why is my exhaust pipe rusting?",
                                    "How do I fix rust on my car’s exhaust?",
                                    "Is it normal for the exhaust system to rust?",
                                    "Can a rusted exhaust pipe cause problems?",
                                    "What should I do if my muffler is rusting?"
                                  ],
                                  "responses": [
                                    "Rust on the exhaust system is common due to heat and moisture. Minor rust can be cleaned, but severe rust can cause leaks or breaks. If your exhaust is excessively rusted, consider replacing it."
                                  ]
                                },
                                {
                                  "tag": "rust_under_the_hood",
                                  "patterns": [
                                    "Why is there rust inside my engine bay?",
                                    "How do I remove rust from my car’s engine parts?",
                                    "My battery terminals and engine parts have rust, what should I do?",
                                    "What causes rust under the hood?",
                                    "How can I prevent rust in my engine compartment?"
                                  ],
                                  "responses": [
                                    "Rust under the hood is usually caused by moisture buildup or leaks. Keeping the engine bay clean, using anti-corrosion sprays, and ensuring good ventilation can help prevent rust formation."
                                  ]
                                },
                                {
                                  "tag": "rust_on_door_hinges",
                                  "patterns": [
                                    "Why are my car’s door hinges rusting?",
                                    "How do I remove rust from my car doors?",
                                    "My car doors are sticking due to rust, how can I fix this?",
                                    "What should I do if my door hinges have rust?",
                                    "How do I stop my car doors from rusting?"
                                  ],
                                  "responses": [
                                    "Rust on door hinges can cause squeaking and difficulty opening doors. Applying penetrating oil or grease can help prevent rust buildup, while severe rust may require hinge replacement."
                                  ]
                                },
                                {
                                  "tag": "rust_on_fuel_tank",
                                  "patterns": [
                                    "Can rust damage my fuel tank?",
                                    "Why is my gas tank rusting?",
                                    "Is it safe to drive with a rusted fuel tank?",
                                    "How do I prevent rust inside my fuel tank?",
                                    "What happens if rust gets into my fuel system?"
                                  ],
                                  "responses": [
                                    "Rust inside the fuel tank can contaminate fuel and damage the fuel pump. Using fuel stabilizers and keeping the tank full can reduce moisture buildup. If the tank is rusted internally, professional cleaning or replacement is recommended."
                                  ]
                                },
                                {
                                  "tag": "rust_on_suspension_components",
                                  "patterns": [
                                    "Why are my car’s suspension parts rusting?",
                                    "How does rust affect suspension components?",
                                    "Can rusted suspension parts be dangerous?",
                                    "How do I remove rust from suspension arms?",
                                    "What should I do if my coil springs are rusting?"
                                  ],
                                  "responses": [
                                    "Rust on suspension parts can weaken them and affect ride quality. Surface rust can be treated, but severe rust may require replacing control arms, springs, or struts. A professional inspection is advised."
                                  ]
                                },
                                {
                                  "tag": "rust_on_bolts_and_screws",
                                  "patterns": [
                                    "Why are the bolts on my car rusting?",
                                    "How do I remove rusted bolts from my car?",
                                    "What can I do if my car’s screws are corroded?",
                                    "Is it safe to drive with rusted bolts?",
                                    "How do I prevent car bolts from rusting?"
                                  ],
                                  "responses": [
                                    "Rust on bolts can make them difficult to remove and weaken their hold. Using rust penetrant spray, lubricating threads, or replacing rusted bolts can help maintain vehicle integrity."
                                  ]
                                },
                                {
                                  "tag": "poor_fuel_economy",
                                  "patterns": [
                                    "Why is my car using more fuel than usual?",
                                    "My gas mileage has dropped, what could be the reason?",
                                    "Why is my car consuming so much fuel?",
                                    "My fuel economy is getting worse, what should I check?",
                                    "Why am I getting fewer miles per gallon than before?"
                                  ],
                                  "responses": [
                                    "A drop in fuel economy can be caused by several factors, including incorrect tire pressure, dirty air filters, worn-out spark plugs, a faulty oxygen sensor, or excessive idling. Regular maintenance and checking for fuel leaks can help improve mileage."
                                  ]
                                },
                                {
                                  "tag": "fuel_injectors_clogged",
                                  "patterns": [
                                    "How do I know if my fuel injectors are clogged?",
                                    "Can dirty fuel injectors affect my gas mileage?",
                                    "Why does my car feel sluggish and use more fuel?",
                                    "My car is hesitating when accelerating and using too much fuel, what could be the cause?",
                                    "Should I clean or replace my fuel injectors if my fuel economy is bad?"
                                  ],
                                  "responses": [
                                    "Clogged fuel injectors can cause poor fuel atomization, leading to inefficient combustion and increased fuel consumption. Using a fuel injector cleaner or having them professionally cleaned can restore performance."
                                  ]
                                },
                                {
                                  "tag": "tire_pressure_light_on",
                                  "patterns": [
                                    "Why is my tire pressure light on?",
                                    "What causes the tire pressure warning light to turn on?",
                                    "Why is my TPMS light on?",
                                    "Why does my car say low tire pressure?",
                                    "How do I fix my tire pressure warning?"
                                  ],
                                  "responses": [
                                    "Your tire pressure light is on because one or more tires may have low pressure, extreme temperature changes could have affected tire inflation, or the TPMS sensor may be faulty. You should check your tire pressure and inflate if needed. If the issue persists, you may need a Tire Replacement & Repair service."
                                  ]
                                },
                                {
                                  "tag": "low_tire_pressure",
                                  "patterns": [
                                    "Can tire pressure affect fuel economy?",
                                    "Why does my car feel sluggish and use more gas?",
                                    "How much fuel efficiency do I lose with underinflated tires?",
                                    "My car’s MPG is dropping, should I check the tires?",
                                    "What is the correct tire pressure for better gas mileage?",
                                    "What happens if my tire pressure is too low?",
                                   "Why do my tires keep losing air?",
                                   "How do I know if my tires need more air?",
                                   "Can low tire pressure cause a flat tire?",
                                    "Why do my tires look deflated?"
                                  ],
                                  "responses": [
                                    "Low tire pressure increases rolling resistance, forcing the engine to work harder and burn more fuel. Keeping your tires properly inflated can improve fuel efficiency by up to 3%."
                                  ]
                                },
                                {
                                  "tag": "old_engine_oil",
                                  "patterns": [
                                    "Does old engine oil affect gas mileage?",
                                    "Why is my car using more fuel after missing an oil change?",
                                    "How does engine oil impact fuel economy?",
                                    "Should I change my oil if my fuel economy is bad?",
                                    "What type of oil is best for better mileage?"
                                  ],
                                  "responses": [
                                    "Old or incorrect engine oil increases friction, reducing engine efficiency and leading to higher fuel consumption. Regular oil changes using the recommended viscosity improve fuel economy."
                                  ]
                                },
                                {
                                  "tag": "tpms_sensor_issue",
                                  "patterns": [
                                    "Can a bad TPMS sensor cause the light to turn on?",
                                    "Why does my tire pressure light stay on even after inflating my tires?",
                                    "How do I reset my tire pressure sensor?",
                                    "Why is my TPMS light flashing?",
                                    "What should I do if my tire pressure warning light won’t turn off?"
                                  ],
                                  "responses": [
                                    "If your tire pressure light stays on even after inflating your tires, your TPMS sensor might be malfunctioning or need recalibration. A diagnostic test can identify the issue. You may need a Tire Replacement & Repair or Car Diagnostic Service."
                                  ]
                                },
                                {
                                  "tag": "temperature_affecting_tire_pressure",
                                  "patterns": [
                                    "Why does my tire pressure light turn on in cold weather?",
                                    "Does temperature affect tire pressure?",
                                    "Why did my TPMS light come on after a cold night?",
                                    "Why do my tires lose pressure when it gets cold?",
                                    "Why does my tire pressure light turn on in the morning?"
                                  ],
                                  "responses": [
                                    "Cold weather can cause tire pressure to drop due to air contraction, triggering the warning light. If the pressure is only slightly low, it may correct itself once the tires warm up. However, if the light remains on, check and inflate your tires. If you suspect a leak, you may need a Tire Replacement & Repair service."
                                  ]
                                },
                                {
                                  "tag": "dragging_brakes",
                                  "patterns": [
                                    "Can bad brakes cause poor fuel economy?",
                                    "Why does my car feel like it’s struggling to move?",
                                    "How do I know if my brakes are dragging?",
                                    "My car’s gas mileage is dropping, could the brakes be the issue?",
                                    "Why does my car slow down quickly when I take my foot off the gas?"
                                  ],
                                  "responses": [
                                    "Dragging brakes create unnecessary friction, forcing the engine to work harder and use more fuel. If you notice a drop in fuel economy, have your brakes inspected for stuck calipers or worn-out components."
                                  ]
                                },
                                {
                                  "tag": "dirty_air_filter",
                                  "patterns": [
                                    "Can a clogged air filter reduce fuel economy?",
                                    "Why does my car feel sluggish and use more fuel?",
                                    "How often should I change my air filter for better gas mileage?",
                                    "Does a dirty air filter affect fuel consumption?",
                                    "What happens if I don’t replace my air filter?"
                                  ],
                                  "responses": [
                                    "A clogged air filter restricts airflow, making the engine work harder and burn more fuel. Replacing the air filter regularly can help maintain optimal fuel efficiency."
                                  ]
                                },
                                {
                                  "tag": "excessive_idling",
                                  "patterns": [
                                    "Does idling waste a lot of fuel?",
                                    "Why does my car consume fuel even when parked?",
                                    "How much fuel is wasted by idling?",
                                    "Should I turn off my engine if I’m waiting in traffic?",
                                    "Does remote starting my car lower fuel economy?"
                                  ],
                                  "responses": [
                                    "Excessive idling consumes fuel without moving the car, reducing overall fuel efficiency. Turning off the engine when parked for long periods can help save fuel."
                                  ]
                                },
                                {
                                  "tag": "bad_spark_plugs",
                                  "patterns": [
                                    "Can bad spark plugs reduce fuel economy?",
                                    "Why is my engine misfiring and using too much gas?",
                                    "How do I know if my spark plugs need replacing?",
                                    "Does replacing spark plugs improve gas mileage?",
                                    "What happens if I don’t change my spark plugs?"
                                  ],
                                  "responses": [
                                    "Worn-out spark plugs cause incomplete combustion, leading to higher fuel consumption. Replacing them at the recommended intervals ensures optimal engine performance and fuel efficiency."
                                  ]
                                },
                                {
                                  "tag": "engine_overheating",
                                  "patterns": [
                                    "Why does my car keep overheating?",
                                    "What causes a car to overheat frequently?",
                                    "My engine temperature is too high, what should I do?",
                                    "Why is my temperature gauge always in the red zone?",
                                    "What should I check if my car is overheating?"
                                  ],
                                  "responses": [
                                    "Your car may be overheating due to low coolant levels, a faulty thermostat, a clogged radiator, or a malfunctioning cooling fan. Check your coolant level and radiator for leaks."
                                  ]
                                },
                                {
                                  "tag": "low_coolant_level",
                                  "patterns": [
                                    "Can low coolant cause my car to overheat?",
                                    "Why is my coolant reservoir empty?",
                                    "How often should I check my coolant?",
                                    "My car is losing coolant but there’s no leak, what could be wrong?",
                                    "Why does my coolant level drop so quickly?"
                                  ],
                                  "responses": [
                                    "Low coolant levels can cause overheating. If there's no visible leak, you might have a blown head gasket or a coolant system issue. Refill your coolant and monitor for further drops."
                                  ]
                                },
                                {
                                  "tag": "faulty_thermostat",
                                  "patterns": [
                                    "Can a bad thermostat cause overheating?",
                                    "How do I know if my thermostat is stuck?",
                                    "Why does my car overheat after a few minutes of driving?",
                                    "My car's temperature fluctuates, could it be the thermostat?",
                                    "How do I check if my thermostat is working properly?"
                                  ],
                                  "responses": [
                                    "A faulty thermostat can get stuck closed, preventing coolant from circulating. This leads to rapid overheating. Replacing the thermostat can fix the issue."
                                  ]
                                },
                                {
                                  "tag": "radiator_clogged",
                                  "patterns": [
                                    "Why is my radiator not cooling properly?",
                                    "Can a clogged radiator cause my car to overheat?",
                                    "How do I know if my radiator needs cleaning?",
                                    "My car overheats but the coolant level is fine, what could be the problem?",
                                    "Why is my radiator full of debris?"
                                  ],
                                  "responses": [
                                    "A clogged radiator prevents proper heat dissipation, causing the engine to overheat. Flushing the radiator or replacing it if it's too damaged can resolve this issue."
                                  ]
                                },
                                {
                                  "tag": "cooling_fan_not_working",
                                  "patterns": [
                                    "Why is my cooling fan not turning on?",
                                    "My car overheats when idling but cools down when moving, what could be the problem?",
                                    "How do I check if my cooling fan is working?",
                                    "Why does my car overheat only in traffic?",
                                    "What happens if the cooling fan stops working?"
                                  ],
                                  "responses": [
                                    "If your cooling fan isn’t turning on, your car may overheat when idling or in traffic. Check the fan relay, motor, and wiring. Replacing a faulty fan can prevent overheating."
                                  ]
                                },
                                {
                                  "tag": "water_pump_failure",
                                  "patterns": [
                                    "Can a bad water pump cause overheating?",
                                    "Why is my car overheating even with a full coolant reservoir?",
                                    "What are the signs of a failing water pump?",
                                    "How do I know if my water pump needs replacing?",
                                    "Why is my engine overheating but there are no leaks?"
                                  ],
                                  "responses": [
                                    "A failing water pump won’t circulate coolant properly, leading to overheating. Look for leaks near the water pump or listen for whining noises from the engine."
                                  ]
                                },
                                {
                                  "tag": "blown_head_gasket",
                                  "patterns": [
                                    "Can a blown head gasket cause overheating?",
                                    "Why is my car overheating and producing white smoke?",
                                    "How do I check if my head gasket is blown?",
                                    "Why is there oil in my coolant?",
                                    "My car is overheating and losing coolant, is it the head gasket?"
                                  ],
                                  "responses": [
                                    "A blown head gasket can allow coolant to leak into the engine, causing overheating and white smoke from the exhaust. Check for milky oil or bubbling in the radiator."
                                  ]
                                },
                                {
                                  "tag": "leaking_radiator_hoses",
                                  "patterns": [
                                    "Why is coolant leaking from my radiator hoses?",
                                    "Can a cracked hose cause overheating?",
                                    "How do I know if my radiator hose is leaking?",
                                    "Why does my car overheat after a long drive?",
                                    "What should I do if my radiator hose bursts?"
                                  ],
                                  "responses": [
                                    "Cracked or loose radiator hoses can cause coolant leaks, leading to overheating. Inspect your hoses for leaks and replace any that are worn out."
                                  ]
                                },
                                {
                                  "tag": "air_pockets_in_cooling_system",
                                  "patterns": [
                                    "Can trapped air cause overheating?",
                                    "Why does my coolant level fluctuate?",
                                    "How do I bleed air from my cooling system?",
                                    "My engine is overheating even though the coolant level is full, why?",
                                    "Why does my temperature gauge spike suddenly?"
                                  ],
                                  "responses": [
                                    "Air pockets in the cooling system can block coolant flow, causing overheating. Bleeding the system by running the engine with the radiator cap off can help remove trapped air."
                                  ]
                                },
                                {
                                  "tag": "overloaded_engine",
                                  "patterns": [
                                    "Can heavy loads cause my car to overheat?",
                                    "Why does my car overheat when towing?",
                                    "My car overheats when driving uphill, is that normal?",
                                    "Why does my temperature go up when carrying extra weight?",
                                    "How can I prevent overheating when hauling heavy loads?"
                                  ],
                                  "responses": [
                                    "Carrying heavy loads or towing can put extra strain on the engine, causing overheating. Reduce stress on the engine by maintaining proper cooling system function and using lower gears when climbing hills."
                                  ]
                                },
                                {
                                  "tag": "rough_idling",
                                  "patterns": [
                                    "Why is my car idling rough?",
                                    "Why does my car vibrate when idling?",
                                    "What causes rough idling?",
                                    "Why does my car feel shaky at a stop?",
                                    "My engine is running unevenly when idle, what could be the problem?"
                                  ],
                                  "responses": [
                                    "Rough idling can be caused by dirty fuel injectors, a faulty spark plug, a clogged air filter, or vacuum leaks. Try cleaning the throttle body and checking your spark plugs."
                                  ]
                                },
                                {
                                  "tag": "bad_spark_plugs",
                                  "patterns": [
                                    "Can bad spark plugs cause rough idling?",
                                    "Why does my engine misfire at idle?",
                                    "How do I know if my spark plugs are bad?",
                                    "My car is shaking at idle, could it be the spark plugs?",
                                    "Why does my car stutter when I stop?"
                                  ],
                                  "responses": [
                                    "Worn or fouled spark plugs can cause misfires and rough idling. Try replacing them to restore smooth engine performance."
                                  ]
                                },
                                {
                                  "tag": "dirty_fuel_injectors",
                                  "patterns": [
                                    "Can dirty fuel injectors cause my car to shake at idle?",
                                    "Why does my engine sputter when idling?",
                                    "How do I clean my fuel injectors?",
                                    "My car vibrates when stopped, could it be a fuel problem?",
                                    "What happens if my fuel injectors are clogged?"
                                  ],
                                  "responses": [
                                    "Dirty fuel injectors can disrupt fuel flow, causing rough idling. Try using a fuel system cleaner or have the injectors professionally cleaned."
                                  ]
                                },
                                {
                                  "tag": "vacuum_leak",
                                  "patterns": [
                                    "Can a vacuum leak cause my car to shake?",
                                    "Why is my car idling rough and making a hissing sound?",
                                    "How do I find a vacuum leak in my engine?",
                                    "My RPMs are fluctuating at idle, is it a vacuum issue?",
                                    "What happens if there's a vacuum leak in my engine?"
                                  ],
                                  "responses": [
                                    "A vacuum leak allows excess air into the engine, causing rough idling. Look for cracked hoses or listen for hissing noises under the hood."
                                  ]
                                },
                                {
                                  "tag": "faulty_mass_airflow_sensor",
                                  "patterns": [
                                    "Can a bad mass airflow sensor cause rough idling?",
                                    "Why does my car shake when idling but drives fine?",
                                    "My check engine light is on and the car idles rough, what could it be?",
                                    "Why does my engine idle poorly after replacing the air filter?",
                                    "How do I test my MAF sensor?"
                                  ],
                                  "responses": [
                                    "A faulty mass airflow (MAF) sensor can send incorrect air-fuel mixture readings to the engine, causing rough idling. Try cleaning or replacing the sensor."
                                  ]
                                },
                                {
                                  "tag": "bad_engine_mounts",
                                  "patterns": [
                                    "Can bad engine mounts cause my car to shake?",
                                    "Why does my car vibrate only when stopped?",
                                    "How do I know if my engine mounts are worn out?",
                                    "Why does my steering wheel shake at idle?",
                                    "What happens if my motor mounts are broken?"
                                  ],
                                  "responses": [
                                    "Worn engine mounts can’t absorb vibrations properly, leading to shaking at idle. If the shaking stops when you put the car in neutral, your mounts may need replacing."
                                  ]
                                },
                                {
                                  "tag": "low_or_old_transmission_fluid",
                                  "patterns": [
                                    "Can low transmission fluid cause my car to shake at a stop?",
                                    "Why does my car jerk when idling?",
                                    "Why does my car idle rough in drive but smooth in neutral?",
                                    "How do I check my transmission fluid?",
                                    "Can old transmission fluid make my car run rough?"
                                  ],
                                  "responses": [
                                    "Low or old transmission fluid can cause rough idling and jerking when stopped. Check your fluid level and condition, and replace it if necessary."
                                  ]
                                },
                                {
                                  "tag": "clogged_air_filter",
                                  "patterns": [
                                    "Can a dirty air filter make my car idle rough?",
                                    "Why does my car feel sluggish at idle?",
                                    "How often should I change my air filter?",
                                    "Why does my engine shake when idling but stops when I accelerate?",
                                    "What are the symptoms of a clogged air filter?"
                                  ],
                                  "responses": [
                                    "A clogged air filter restricts airflow to the engine, leading to rough idling. Replacing the filter can improve performance."
                                  ]
                                },
                                {
                                  "tag": "failing_idle_air_control_valve",
                                  "patterns": [
                                    "Why does my car idle high and then low?",
                                    "Can a bad idle control valve cause rough idling?",
                                    "Why does my RPM drop when I stop?",
                                    "How do I fix an erratic idle?",
                                    "My car stalls when idling, what could be wrong?"
                                  ],
                                  "responses": [
                                    "A failing idle air control (IAC) valve can cause unstable RPMs and rough idling. Cleaning or replacing the valve may help."
                                  ]
                                },
                                {
                                  "tag": "gear_shifting_jerking",
                                  "patterns": [
                                    "Why is my car jerking when I shift gears?",
                                    "Why does my car jerk when changing gears?",
                                    "What causes rough gear shifting?",
                                    "Why does my car lurch forward when I shift?",
                                    "Why does my car feel like it kicks when shifting gears?"
                                  ],
                                  "responses": [
                                    "Jerking when shifting gears can be caused by low transmission fluid, a worn-out clutch, dirty transmission fluid, a failing torque converter, or bad engine mounts."
                                  ]
                                },
                                {
                                  "tag": "low_transmission_fluid",
                                  "patterns": [
                                    "Can low transmission fluid cause jerking when shifting?",
                                    "Why does my car hesitate between gear shifts?",
                                    "My automatic transmission is jerking, is it low on fluid?",
                                    "How do I know if my transmission fluid is low?",
                                    "Why does my car feel like it slips when changing gears?"
                                  ],
                                  "responses": [
                                    "Low transmission fluid can cause gear slippage and jerking. Check your transmission fluid level and top it off if needed."
                                  ]
                                },
                                {
                                  "tag": "dirty_transmission_fluid",
                                  "patterns": [
                                    "Can old transmission fluid cause rough shifting?",
                                    "Why does my car jerk when I shift gears after driving for a while?",
                                    "How often should I change my transmission fluid?",
                                    "My transmission fluid looks dirty, could that be causing problems?",
                                    "Why is my car downshifting harshly?"
                                  ],
                                  "responses": [
                                    "Dirty or old transmission fluid can cause rough shifting and gear jerking. Try flushing and replacing the transmission fluid."
                                  ]
                                },
                                {
                                  "tag": "worn_out_clutch",
                                  "patterns": [
                                    "Can a bad clutch cause jerky shifting?",
                                    "Why does my manual car jerk when I change gears?",
                                    "How do I know if my clutch is bad?",
                                    "Why does my car lurch forward when I shift gears?",
                                    "My clutch feels stiff and the car jerks, what could be wrong?"
                                  ],
                                  "responses": [
                                    "A worn-out clutch can make shifting gears jerky and difficult. If your clutch feels stiff or doesn’t engage smoothly, it might need replacement."
                                  ]
                                },
                                {
                                  "tag": "bad_torque_converter",
                                  "patterns": [
                                    "Can a bad torque converter cause jerky shifting?",
                                    "Why does my car shudder when shifting gears?",
                                    "What are the symptoms of a failing torque converter?",
                                    "My automatic transmission feels rough when shifting, what could be wrong?",
                                    "Why does my car hesitate before shifting gears?"
                                  ],
                                  "responses": [
                                    "A failing torque converter can cause rough gear shifts, shuddering, or delays. If the problem is severe, the torque converter may need replacement."
                                  ]
                                },
                                {
                                  "tag": "bad_engine_mounts",
                                  "patterns": [
                                    "Can bad engine mounts cause my car to jerk?",
                                    "Why does my car shake when I shift gears?",
                                    "How do I know if my motor mounts are bad?",
                                    "My car jerks when I change gears, could it be the engine mounts?",
                                    "Why does my car lurch forward when shifting into drive?"
                                  ],
                                  "responses": [
                                    "Worn-out engine mounts can’t absorb vibrations properly, causing the car to jerk when shifting gears. Replacing the mounts can fix this issue."
                                  ]
                                },
                                {
                                  "tag": "throttle_body_issue",
                                  "patterns": [
                                    "Can a dirty throttle body cause rough shifting?",
                                    "Why does my car hesitate and jerk when I shift gears?",
                                    "Why does my RPM spike when I change gears?",
                                    "My engine revs high before shifting, what could be wrong?",
                                    "Can a throttle body issue make gear shifts rough?"
                                  ],
                                  "responses": [
                                    "A dirty throttle body can cause inconsistent airflow, leading to rough gear shifts. Cleaning the throttle body can help smooth out shifting."
                                  ]
                                },
                                {
                                  "tag": "faulty_shift_solenoid",
                                  "patterns": [
                                    "What happens if my shift solenoid is bad?",
                                    "Why does my automatic transmission shift hard?",
                                    "Why does my car jerk when downshifting?",
                                    "Can a bad solenoid cause transmission jerking?",
                                    "My car shifts gears too quickly, what could be wrong?"
                                  ],
                                  "responses": [
                                    "A faulty shift solenoid can cause delayed or rough shifting. A mechanic can diagnose and replace it if necessary."
                                  ]
                                },
          {
              "tag": "delayed_engagement",
              "patterns": [
                "Why is there a delay when I put my car in drive?",
                "Why does my car take a few seconds to go into drive?",
                "Why is there a delay when shifting into reverse?",
                "My car hesitates before moving when I shift gears, what could be wrong?",
                "Why does my automatic transmission take time to engage?",
                "What causes a delay when I put my car in gear?"
              ],
              "responses": [
                "A delay when shifting into drive or reverse is often caused by low transmission fluid, dirty or old transmission fluid, a failing shift solenoid, or a worn-out torque converter."
              ]
            },
            {
              "tag": "low_transmission_fluid",
              "patterns": [
                "Can low transmission fluid cause a delay when shifting?",
                "Why does my transmission take time to respond?",
                "Why does my car hesitate before moving in drive?",
                "My car doesn't shift into drive immediately, could it be low fluid?",
                "How do I know if my transmission fluid is low?"
              ],
              "responses": [
                "Low transmission fluid can prevent the transmission from engaging smoothly, causing delays when shifting gears. Check your fluid level and refill if needed."
              ]
            },
            {
              "tag": "dirty_transmission_fluid",
              "patterns": [
                "Can dirty transmission fluid cause slow shifting?",
                "Why does my automatic car shift gears late?",
                "Why is my transmission sluggish when changing gears?",
                "What happens if I don’t change my transmission fluid?",
                "Why does my car jerk and hesitate when I shift gears?"
              ],
              "responses": [
                "Dirty or old transmission fluid can clog the system, causing sluggish or delayed gear engagement. A transmission fluid flush may help."
              ]
            },
            {
              "tag": "faulty_shift_solenoid",
              "patterns": [
                "Can a bad shift solenoid cause a delay in shifting?",
                "Why does my transmission take long to engage?",
                "What are the signs of a failing shift solenoid?",
                "Why is my car stuck in neutral before engaging drive?",
                "Can a bad shift solenoid cause slow gear engagement?"
              ],
              "responses": [
                "A faulty shift solenoid can cause transmission delays and rough shifting. A mechanic can diagnose and replace it if needed."
              ]
            },
            {
              "tag": "worn_out_torque_converter",
              "patterns": [
                "Can a bad torque converter cause a delay in shifting?",
                "Why does my car take time to move after shifting?",
                "What happens when a torque converter fails?",
                "My car doesn't accelerate immediately after shifting into drive, what could be wrong?",
                "Why does my transmission hesitate before engaging?"
              ],
              "responses": [
                "A worn-out torque converter can cause hesitation when shifting gears. If the issue persists, the torque converter may need replacement."
              ]
            },
            {
              "tag": "cold_transmission_fluid",
              "patterns": [
                "Why does my car shift slow when it's cold?",
                "Why does my car hesitate in the morning before driving?",
                "Can cold weather affect my transmission?",
                "Why does my transmission take time to shift in winter?",
                "My car hesitates in drive only when it’s cold, what could be wrong?"
              ],
              "responses": [
                "Cold transmission fluid thickens and takes longer to flow, causing sluggish shifting. Let your car warm up before driving in cold weather."
              ]
            },
            {
              "tag": "clogged_transmission_filter",
              "patterns": [
                "Can a clogged transmission filter cause shifting delays?",
                "Why does my car take long to go into drive?",
                "Why does my transmission hesitate before shifting?",
                "What happens if my transmission filter is dirty?",
                "Why does my car take a while to engage gears?"
              ],
              "responses": [
                "A clogged transmission filter can restrict fluid flow, leading to delays in gear engagement. Replacing the filter can help restore smooth shifting."
              ]
            },
            
            {
              "tag": "whining_noise_acceleration",
              "patterns": [
                "Why is my car making a whining noise when I accelerate?",
                "Why do I hear a high-pitched whining sound when I press the gas?",
                "What causes a whining sound when my car speeds up?",
                "Why is my engine whining when I accelerate?",
                "What could be making my car whine when I drive?"
              ],
              "responses": [
                "A whining noise during acceleration could be caused by a failing transmission, a worn-out serpentine belt, a faulty alternator, or low power steering fluid."
              ]
            },
            {
              "tag": "grinding_noise_acceleration",
              "patterns": [
                "Why is my car making a grinding noise when I accelerate?",
                "Why do I hear a rough grinding sound when I speed up?",
                "What causes a grinding sound when I press the gas pedal?",
                "Why does my engine sound rough when accelerating?",
                "What could be making my car grind when I drive?"
              ],
              "responses": [
                "A grinding noise when accelerating may be caused by worn-out CV joints, bad wheel bearings, or transmission issues."
              ]
            },
            {
              "tag": "failing_transmission",
              "patterns": [
                "Can a bad transmission cause a whining noise?",
                "Why does my transmission make a whining sound when I accelerate?",
                "Why does my automatic transmission whine when I speed up?",
                "What does a failing transmission sound like?",
                "Why does my car make noise when shifting gears?"
              ],
              "responses": [
                "A failing transmission can produce a whining sound due to low fluid, worn-out gears, or a failing torque converter. You may need a Car Diagnostic Service."
              ]
            },
            {
              "tag": "worn_out_serpentine_belt",
              "patterns": [
                "Can a bad serpentine belt cause whining?",
                "Why does my car whine when I accelerate?",
                "What happens if my serpentine belt is worn out?",
                "Why does my engine make a high-pitched sound?",
                "Why does my belt squeal when I drive?"
              ],
              "responses": [
                "A worn-out or loose serpentine belt can cause a whining noise when accelerating. It may need to be tightened or replaced. You may need an Engine Tune-Up."
              ]
            },
            {
              "tag": "faulty_alternator",
              "patterns": [
                "Can a bad alternator make a whining sound?",
                "Why does my alternator whine when I press the gas?",
                "What does a bad alternator sound like?",
                "Why does my car make a whining noise at high RPMs?",
                "Could my alternator be causing a noise when accelerating?"
              ],
              "responses": [
                "A faulty alternator can produce a whining noise, especially if the bearings are worn out. You may need a Battery Replacement service."
              ]
            },
            {
              "tag": "low_power_steering_fluid",
              "patterns": [
                "Can low power steering fluid cause whining?",
                "Why does my car whine when I turn the wheel?",
                "What happens if my power steering fluid is low?",
                "Why does my steering make a whining sound?",
                "Why is my power steering pump making noise?"
              ],
              "responses": [
                "Low power steering fluid can cause a whining noise when turning or accelerating. Topping up the fluid may resolve the issue. You may need a Car Diagnostic Service."
              ]
            },
            {
              "tag": "worn_out_cv_joints",
              "patterns": [
                "Can bad CV joints make a grinding noise?",
                "Why do I hear a grinding noise when I turn?",
                "What happens if my CV joints are worn out?",
                "Why does my car make a grinding noise when I drive?",
                "Could my CV joints be causing a noise when accelerating?"
              ],
              "responses": [
                "Worn-out CV joints can make grinding or clicking noises, especially when turning or accelerating. You may need a Car Diagnostic Service."
              ]
            },
            {
              "tag": "bad_wheel_bearings",
              "patterns": [
                "Can bad wheel bearings cause grinding noises?",
                "Why does my car make a grinding sound when I drive?",
                "What happens if my wheel bearings are bad?",
                "Why does my car make noise when I accelerate or turn?",
                "Could my wheel bearings be causing a grinding noise?"
              ],
              "responses": [
                "Bad wheel bearings can cause grinding or humming noises while driving. A mechanic can check and replace them if necessary. You may need a Car Diagnostic Service."
              ]
            },
  {
      "tag": "soft_brake_pedal",
      "patterns": [
        "Why is my brake pedal soft?",
        "Why does my brake pedal feel spongy?",
        "Why do my brakes feel mushy when I press the pedal?",
        "What causes a soft brake pedal?",
        "Why does my brake pedal go to the floor when I press it?"
      ],
      "responses": [
        "A soft or spongy brake pedal is often caused by air in the brake lines, low brake fluid, or a failing master cylinder. This can reduce braking efficiency and should be checked immediately. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "air_in_brake_lines",
      "patterns": [
        "Can air in brake lines cause a soft pedal?",
        "Why do my brakes feel soft after changing the brake fluid?",
        "Why does my brake pedal feel weak?",
        "How do I know if I have air in my brake lines?",
        "Why do I have to pump my brakes to get them to work?"
      ],
      "responses": [
        "Air trapped in the brake lines prevents proper hydraulic pressure, causing the pedal to feel soft. Bleeding the brakes can remove the air and restore proper function. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "low_brake_fluid",
      "patterns": [
        "Can low brake fluid cause a soft brake pedal?",
        "Why does my brake pedal feel soft all of a sudden?",
        "Why does my brake pedal go all the way down?",
        "What happens if my brake fluid is too low?",
        "How do I know if my brake fluid is leaking?"
      ],
      "responses": [
        "Low brake fluid can cause the brake pedal to feel soft, often due to a leak in the system. Checking and refilling the brake fluid may help, but a professional inspection is recommended. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "master_cylinder_failure",
      "patterns": [
        "Can a bad master cylinder cause a soft brake pedal?",
        "Why do my brakes feel soft even after adding fluid?",
        "Why do I have to press the brake pedal really hard to stop?",
        "What are the symptoms of a failing master cylinder?",
        "Why does my brake pedal sink slowly when I press it?"
      ],
      "responses": [
        "A failing master cylinder can cause a soft brake pedal by allowing fluid to bypass its internal seals. This can lead to reduced braking power and should be addressed immediately. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "brake_hose_or_caliper_issue",
      "patterns": [
        "Can a bad brake hose cause a soft brake pedal?",
        "Why does my brake pedal feel weak when I press it?",
        "Why do my brakes take longer to respond?",
        "What happens if my brake hose is leaking?",
        "Why do my brakes feel squishy even after bleeding them?"
      ],
      "responses": [
        "A damaged brake hose or leaking caliper can reduce braking pressure, causing a soft pedal. Inspecting and replacing damaged components can fix the issue. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "abs_modulator_issue",
      "patterns": [
        "Can ABS cause a soft brake pedal?",
        "Why do my brakes feel weird after an ABS activation?",
        "Why does my brake pedal feel spongy when stopping suddenly?",
        "What happens if my ABS module fails?",
        "Why do my brakes feel inconsistent?"
      ],
      "responses": [
        "A faulty ABS modulator can cause inconsistent brake pressure, leading to a soft pedal. A diagnostic check can determine if the ABS system is malfunctioning. You may need a Car Diagnostic Service."
      ]
    },
    {
      "tag": "car_pulls_while_braking",
      "patterns": [
        "Why is my car pulling to one side when I brake?",
        "Why does my car veer to one side when braking?",
        "What causes my car to pull left or right when I press the brakes?",
        "Why does my steering wheel move when I brake?",
        "Why is my car not stopping straight when I brake?"
      ],
      "responses": [
        "If your car pulls to one side when braking, it may be due to uneven brake pad wear, a stuck brake caliper, or issues with the brake fluid distribution. A professional brake inspection can diagnose and fix the issue. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "uneven_brake_pad_wear",
      "patterns": [
        "Can uneven brake pads make my car pull to one side?",
        "Why does my car swerve when braking?",
        "Why do my brakes feel unbalanced?",
        "What happens if one brake pad wears out faster than the other?",
        "Why is my left/right brake working harder than the other?"
      ],
      "responses": [
        "Uneven brake pad wear can cause one side to apply more braking force, pulling the car to that side. Replacing the pads on both sides can restore even braking. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "stuck_brake_caliper",
      "patterns": [
        "Can a stuck caliper make my car pull to one side?",
        "Why is one brake gripping harder than the other?",
        "Why does my car feel like it’s dragging when I brake?",
        "What happens if my brake caliper is seized?",
        "Why is my wheel hot after driving?"
      ],
      "responses": [
        "A stuck brake caliper can cause uneven braking force, leading to the car pulling to one side. It can also overheat the brake components, causing damage. A brake inspection is recommended. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "brake_fluid_or_hydraulic_issue",
      "patterns": [
        "Can brake fluid problems cause my car to pull when braking?",
        "Why is one brake working better than the other?",
        "Why do my brakes feel unresponsive on one side?",
        "What happens if my brake lines are blocked?",
        "Why does my car feel unstable when braking?"
      ],
      "responses": [
        "An issue with brake fluid distribution, such as air in the brake lines or a blockage, can cause uneven braking. A professional diagnostic check can identify and resolve the problem. You may need a Car Diagnostic Service or a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "uneven_tire_pressure_or_wear",
      "patterns": [
        "Can bad tires make my car pull when I brake?",
        "Why does my car feel wobbly when braking?",
        "Why do my tires affect my braking?",
        "What happens if my front tires are worn unevenly?",
        "Why does my car steer itself when I press the brakes?"
      ],
      "responses": [
        "Uneven tire wear or incorrect tire pressure can cause the car to pull when braking. Checking and rotating the tires may fix the issue. You may need a Tire Replacement & Repair service."
      ]
    },
    {
      "tag": "brake_vibrations",
      "patterns": [
        "Why do I feel vibrations when I press the brakes?",
        "Why does my steering wheel shake when I brake?",
        "Why is my car vibrating when I slow down?",
        "What causes a pulsating brake pedal?",
        "Why do my brakes feel rough and shaky?"
      ],
      "responses": [
        "If you feel vibrations when braking, it could be due to warped brake rotors, uneven brake pad wear, or suspension issues. A professional brake inspection is recommended. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "warped_brake_rotors",
      "patterns": [
        "Can warped rotors cause vibrations when braking?",
        "Why do my brakes feel bumpy?",
        "What happens if my brake rotors are warped?",
        "Why do I hear a thumping sound when braking?",
        "Do I need to replace my brake rotors if my car shakes?"
      ],
      "responses": [
        "Warped brake rotors can cause shaking and reduced braking performance. Resurfacing or replacing them is recommended to restore smooth braking. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "uneven_brake_pads",
      "patterns": [
        "Why do my brake pads wear unevenly?",
        "Can worn-out brake pads cause shaking?",
        "Why do my new brake pads feel rough?",
        "What causes my brake pads to wear down faster on one side?",
        "Do I need to replace my brake pads if my car vibrates?"
      ],
      "responses": [
        "Uneven brake pad wear can lead to vibrations when braking. Replacing your brake pads and ensuring proper alignment is recommended. You may need a Brake Inspection & Repair service."
      ]
    },
    {
      "tag": "suspension_or_alignment_issue",
      "patterns": [
        "Can bad suspension cause my car to shake when braking?",
        "Why does my car feel unstable when I brake?",
        "Does wheel alignment affect braking?",
        "Why does my car pull to one side when I press the brakes?",
        "Why do my tires feel wobbly when I brake?"
      ],
      "responses": [
        "If your car shakes when braking, misaligned wheels or suspension issues could be the cause. A full diagnostic and wheel alignment check is recommended. You may need a Car Diagnostic Service."
      ]
    },
    
      {
        "tag": "alternator_not_charging",
        "patterns": [
          "Why is my car’s alternator not charging the battery?",
          "What causes an alternator to stop charging the battery?",
          "Why is my battery dead even though I replaced it?",
          "How do I know if my alternator is bad?",
          "Why does my car keep losing battery power?"
        ],
        "responses": [
          "If your alternator is not charging the battery, it could be due to a worn-out alternator, loose or corroded battery cables, a bad voltage regulator, or a broken serpentine belt. You should get it checked immediately. You may need a Battery Replacement or Car Diagnostic Service."
        ]
      },
      {
        "tag": "bad_voltage_regulator",
        "patterns": [
          "Can a bad voltage regulator cause the alternator to stop charging?",
          "Why is my alternator working but my battery still dies?",
          "How do I know if my voltage regulator is faulty?",
          "Why is my car’s electrical system acting up?",
          "Why does my car’s battery voltage keep fluctuating?"
        ],
        "responses": [
          "A faulty voltage regulator can prevent the alternator from properly charging the battery, causing inconsistent power supply and battery drainage. A professional diagnostic is recommended. You may need a Battery Replacement or Car Diagnostic Service."
        ]
      },
      {
        "tag": "loose_or_damaged_alternator_belt",
        "patterns": [
          "Can a loose alternator belt cause charging problems?",
          "Why is my alternator not spinning properly?",
          "Why is my battery light on and my power steering failing?",
          "What happens if my alternator belt breaks?",
          "How do I fix an alternator that is not charging?"
        ],
        "responses": [
          "A loose or damaged alternator belt can prevent the alternator from charging the battery. If the belt snaps, the alternator will stop working completely. It’s best to get it inspected. You may need a Car Diagnostic Service or Battery Replacement."
        ]
      },
      {
        "tag": "blown_fuses_or_wiring_issues",
        "patterns": [
          "Can a blown fuse cause my alternator to stop charging?",
          "Why is my battery draining but my alternator is fine?",
          "Can faulty wiring stop my battery from charging?",
          "How do I check if my alternator fuse is blown?",
          "Why is my battery light flickering on and off?"
        ],
        "responses": [
          "Blown fuses or damaged wiring can prevent the alternator from sending power to the battery. Checking the alternator fuse and wiring is essential. If unsure, a professional check is recommended. You may need a Car Diagnostic Service or Battery Replacement."
        ]
      },
    
      {
          "tag": "car_vibrating_at_high_speeds",
          "patterns": [
            "Why is my car vibrating at high speeds?",
            "What causes my car to shake when I drive fast?",
            "Why does my steering wheel vibrate at highway speeds?",
            "Why does my car feel shaky at high speeds?",
            "Why do I feel vibrations when driving over 60 mph?"
          ],
          "responses": [
            "Your car may be vibrating at high speeds due to unbalanced tires, misaligned wheels, worn suspension components, or brake issues. It's recommended to get your wheels balanced and aligned. If the issue persists, you may need a Tire Replacement & Repair or Car Diagnostic Service."
          ]
        },
        {
          "tag": "unbalanced_tires",
          "patterns": [
            "Can unbalanced tires cause vibrations?",
            "Why does my car shake after getting new tires?",
            "How do I know if my tires are out of balance?",
            "Can wheel balancing fix my car shaking issue?",
            "Why does my car wobble at certain speeds?"
          ],
          "responses": [
            "Unbalanced tires can cause vibrations, especially at higher speeds. A wheel balancing service can fix this issue. If you recently got new tires and feel vibrations, they may need to be rebalanced. You may need a Tire Replacement & Repair service."
          ]
        },
        {
          "tag": "wheel_alignment_issue",
          "patterns": [
            "Can bad wheel alignment cause my car to shake?",
            "Why is my car vibrating and pulling to one side?",
            "How do I know if my wheels need alignment?",
            "What are the signs of bad wheel alignment?",
            "Why does my car shake after hitting a pothole?"
          ],
          "responses": [
            "Misaligned wheels can cause vibrations and uneven tire wear. If your car is also pulling to one side, it's likely an alignment issue. A professional alignment service can resolve this. You may need a Tire Replacement & Repair service."
          ]
        },
        {
          "tag": "worn_suspension_or_steering_components",
          "patterns": [
            "Can bad suspension cause my car to shake?",
            "Why does my car vibrate when going over bumps?",
            "Can a worn-out control arm cause vibrations?",
            "What are the signs of bad suspension?",
            "Why does my car feel unstable at high speeds?"
          ],
          "responses": [
            "Worn suspension or steering components, such as control arms, tie rods, or bushings, can cause vibrations and make your car feel unstable. A thorough check-up is needed. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "brake_rotor_issue",
          "patterns": [
            "Can bad brake rotors cause vibrations?",
            "Why does my car shake when I slow down from high speeds?",
            "Why does my steering wheel vibrate when I brake?",
            "How do I know if my brake rotors are warped?",
            "Why does my car shake when I press the brakes?"
          ],
          "responses": [
            "Warped or uneven brake rotors can cause vibrations, especially when slowing down from high speeds. If you notice this issue, a brake inspection is needed. You may need a Brake Inspection & Repair service."
          ]
        },
        {
          "tag": "steering_wheel_off_center",
          "patterns": [
            "Why is my steering wheel off-center when driving straight?",
            "Why does my steering wheel not align when driving straight?",
            "What causes my steering wheel to be crooked?",
            "Why does my car pull to one side while driving?",
            "How do I fix an off-center steering wheel?"
          ],
          "responses": [
            "An off-center steering wheel when driving straight is usually caused by poor wheel alignment, worn suspension components, or uneven tire wear. A professional wheel alignment service can correct this issue. You may need a Tire Replacement & Repair or Car Diagnostic Service."
          ]
        },
        {
          "tag": "catalytic_converter_light_on",
          "patterns": [
            "Why is my catalytic converter light on?",
            "What does it mean when the catalytic converter warning light comes on?",
            "Why is my check engine light on with a catalytic converter error?",
            "How do I fix a catalytic converter warning light?",
            "Why is my car showing a catalytic converter fault?"
          ],
          "responses": [
            "Your catalytic converter warning light may be on due to excessive emissions, a failing catalytic converter, or an issue with the oxygen sensors. This can lead to reduced engine performance and higher fuel consumption. A diagnostic check is recommended to identify the problem. You may need a Car Diagnostic Service or an Engine Tune-Up."
          ]
        },
        {
          "tag": "catalytic_converter_failure",
          "patterns": [
            "What happens if my catalytic converter fails?",
            "How do I know if my catalytic converter is bad?",
            "Why is my car losing power and the catalytic converter light is on?",
            "Why does my car smell like rotten eggs?",
            "Can I drive with a bad catalytic converter?"
          ],
          "responses": [
            "A failing catalytic converter can cause poor acceleration, strange smells (like rotten eggs), and increased emissions. Ignoring it can lead to engine damage or legal issues in emissions-controlled areas. A diagnostic check is needed to confirm. You may need a Car Diagnostic Service or an Engine Tune-Up."
          ]
        },
        {
          "tag": "engine_sputtering_acceleration",
          "patterns": [
            "Why is my car sputtering or choking when I accelerate?",
            "Why does my engine hesitate when I press the gas?",
            "Why is my car struggling to accelerate smoothly?",
            "Why does my car feel like it's choking when I step on the gas?",
            "What causes my car to sputter under acceleration?"
          ],
          "responses": [
            "Your car may sputter or choke when accelerating due to a clogged fuel filter, failing spark plugs, or a problem with the fuel injectors. A dirty air filter or malfunctioning mass airflow sensor could also be restricting airflow. A full diagnostic check is recommended. You may need a Car Diagnostic Service or an Engine Tune-Up."
          ]
        },
        {
          "tag": "fuel_system_issue",
          "patterns": [
            "Can bad fuel injectors cause my car to sputter?",
            "Why does my car hesitate when I press the accelerator?",
            "Why is my engine misfiring when I try to speed up?",
            "How do I know if my fuel pump is failing?",
            "What happens if my fuel filter is clogged?"
          ],
          "responses": [
            "A clogged fuel filter, dirty fuel injectors, or a weak fuel pump can cause engine sputtering and hesitation during acceleration. These issues restrict fuel delivery, leading to poor performance. A fuel system check is recommended. You may need a Car Diagnostic Service or an Engine Tune-Up."
          ]
        },
        {
          "tag": "ignition_system_issue",
          "patterns": [
            "Can bad spark plugs cause my car to sputter?",
            "Why is my engine misfiring under load?",
            "Why does my car shake when I accelerate?",
            "What happens if my ignition coils are bad?",
            "How do I know if my car's spark plugs need to be replaced?"
          ],
          "responses": [
            "Faulty spark plugs or ignition coils can cause misfires and engine hesitation when accelerating. This leads to rough driving and reduced fuel efficiency. It's best to check and replace worn-out ignition components. You may need an Engine Tune-Up."
          ]
        },
        {
          "tag": "airflow_issue",
          "patterns": [
            "Why does my car feel like it's suffocating when I accelerate?",
            "Can a dirty air filter cause acceleration problems?",
            "Why is my mass airflow sensor causing issues?",
            "Why does my car lose power when I press the gas?",
            "How do I fix air intake problems in my car?"
          ],
          "responses": [
            "A clogged air filter or faulty mass airflow sensor can disrupt the air-to-fuel ratio, leading to engine sputtering during acceleration. Cleaning or replacing these components can restore performance. You may need an Engine Tune-Up or a Car Diagnostic Service."
          ]
        },
        {
          "tag": "fuel_gauge_not_working",
          "patterns": [
            "Why is my fuel gauge not working?",
            "Why is my gas gauge stuck on empty?",
            "Why is my fuel gauge inaccurate?",
            "Why is my fuel gauge showing the wrong reading?",
            "Why does my gas gauge fluctuate randomly?",
            "What causes my fuel gauge to stop working?",
            "Why is my gas gauge stuck on full?"
          ],
          "responses": [
            "Your fuel gauge may not be working due to a faulty fuel sending unit, a damaged fuel gauge, or a wiring issue. In some cases, a blown fuse or a bad instrument cluster could also cause inaccurate readings. A full system diagnostic is recommended. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "fuel_sending_unit_failure",
          "patterns": [
            "Can a bad fuel sending unit cause my fuel gauge to stop working?",
            "How do I know if my fuel sending unit is bad?",
            "Why is my fuel gauge stuck on empty even when my tank is full?",
            "Why does my fuel gauge not move at all?",
            "Why does my gas gauge stay on full all the time?"
          ],
          "responses": [
            "A malfunctioning fuel sending unit inside the fuel tank can cause your fuel gauge to display incorrect readings or remain stuck. This issue usually requires replacing the sending unit. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "wiring_or_fuse_issue",
          "patterns": [
            "Can a blown fuse cause my fuel gauge to stop working?",
            "Why does my fuel gauge work sometimes but not always?",
            "Why did my fuel gauge stop working after a battery change?",
            "How do I know if there's a wiring problem with my fuel gauge?",
            "What happens if the wiring to my fuel gauge is damaged?"
          ],
          "responses": [
            "A blown fuse, corroded wiring, or a poor electrical connection can disrupt your fuel gauge's operation. Checking and replacing the faulty fuse or repairing the wiring should fix the issue. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "instrument_cluster_failure",
          "patterns": [
            "Can a bad instrument cluster affect my fuel gauge?",
            "Why is my entire dashboard malfunctioning?",
            "Why is my fuel gauge stuck even after replacing the sending unit?",
            "Why is my fuel gauge not responding at all?",
            "What happens if my car’s instrument panel fails?"
          ],
          "responses": [
            "A failing instrument cluster can prevent your fuel gauge from working properly. If other dashboard indicators are also malfunctioning, you may need to repair or replace the instrument panel. A Car Diagnostic Service is recommended."
          ]
        },
  
        {
          "tag": "heater_not_blowing_hot_air",
          "patterns": [
            "Why is my heater not blowing hot air?",
            "Why is my car's heater blowing cold air?",
            "Why is my car heater not getting warm?",
            "Why is my heater not working in my car?",
            "What causes a car heater to stop blowing hot air?",
            "Why does my heater blow warm air at first, then cold?",
            "Why is my defroster not blowing hot air?"
          ],
          "responses": [
            "Your car’s heater may not be blowing hot air due to low coolant levels, a stuck thermostat, a clogged heater core, or a faulty blend door actuator. A system diagnostic is recommended. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "low_coolant_level",
          "patterns": [
            "Can low coolant cause my heater to stop working?",
            "Why does my car heater work sometimes but not always?",
            "Why is my heater not getting hot even though the engine is running?",
            "How does coolant affect my car’s heating system?",
            "Why does my heater only work when I'm driving?"
          ],
          "responses": [
            "If your coolant level is too low, there may not be enough fluid to transfer heat to the heater core, causing your heater to blow cold air. Checking and refilling the coolant may fix the issue. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "stuck_thermostat",
          "patterns": [
            "Can a bad thermostat cause my heater to blow cold air?",
            "Why does my heater take a long time to warm up?",
            "Why does my car overheat but my heater stays cold?",
            "Why is my heater cold even after driving for a while?",
            "What happens if my car's thermostat is stuck open?"
          ],
          "responses": [
            "A stuck-open thermostat can prevent the engine from reaching the proper temperature, causing the heater to blow cold air. Replacing the thermostat may fix the issue. You may need an Engine Tune-Up."
          ]
        },
        {
          "tag": "clogged_heater_core",
          "patterns": [
            "Can a clogged heater core cause my heater to stop working?",
            "Why does my heater blow weak air?",
            "Why is there no heat coming from my car vents?",
            "How do I know if my heater core is clogged?",
            "Why does my car fog up inside when I use the heater?"
          ],
          "responses": [
            "A clogged heater core can block the flow of hot coolant, preventing the heater from warming up. Flushing or replacing the heater core may be necessary. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "faulty_blend_door_actuator",
          "patterns": [
            "Why does my heater only blow cold air on one side?",
            "Why does my heater not switch between hot and cold?",
            "Can a blend door actuator cause my heater to stop working?",
            "Why is my passenger side warm but the driver’s side cold?",
            "Why does my car's heater work randomly?"
          ],
          "responses": [
            "A faulty blend door actuator can prevent your car from switching between hot and cold air, leading to inconsistent heating. Replacing the actuator may resolve the issue. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "temperature_gauge_in_red",
          "patterns": [
            "Why is my temperature gauge in the red?",
            "Why is my engine temperature so high?",
            "What does it mean when my temperature gauge is in the red?",
            "Why is my temperature warning light on?",
            "Why is my car overheating?",
            "Why is my engine running hot?",
            "What should I do if my temperature gauge is in the red?",
            "Why does my temperature gauge keep rising?"
          ],
          "responses": [
            "If your temperature gauge is in the red, your engine is overheating. This could be due to low coolant levels, a failing thermostat, a radiator issue, or a malfunctioning water pump. Immediate inspection is needed. You may need a Car Diagnostic Service or an Engine Tune-Up."
          ]
        },
        {
          "tag": "low_coolant_overheating",
          "patterns": [
            "Can low coolant cause my car to overheat?",
            "Why does my car overheat when the coolant is low?",
            "Why is my coolant level dropping?",
            "What happens if my car runs out of coolant?",
            "Why do I need to keep refilling my coolant?"
          ],
          "responses": [
            "Low coolant levels can cause your engine to overheat because there isn't enough fluid to regulate temperature. Check for leaks and refill your coolant as needed. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "failing_thermostat",
          "patterns": [
            "Can a bad thermostat cause overheating?",
            "Why does my engine overheat but my radiator stays cool?",
            "Why does my car take too long to cool down?",
            "What happens if my car thermostat gets stuck?",
            "How do I know if my thermostat is failing?"
          ],
          "responses": [
            "A failing thermostat can get stuck closed, preventing coolant from circulating, which leads to overheating. Replacing the thermostat may fix the issue. You may need an Engine Tune-Up."
          ]
        },
        {
          "tag": "radiator_issue",
          "patterns": [
            "Can a bad radiator cause my car to overheat?",
            "Why does my radiator overheat?",
            "Why is my radiator leaking?",
            "What happens if my radiator is clogged?",
            "How do I know if my radiator is failing?"
          ],
          "responses": [
            "A clogged, leaking, or damaged radiator can prevent the engine from cooling properly, leading to overheating. Flushing or replacing the radiator may be necessary. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "water_pump_failure",
          "patterns": [
            "Can a bad water pump cause overheating?",
            "Why does my car overheat even with enough coolant?",
            "How do I know if my water pump is bad?",
            "Why is my coolant not circulating?",
            "What happens if my water pump fails?"
          ],
          "responses": [
            "A failing water pump can stop coolant from circulating, causing the engine to overheat. Replacing the water pump may be necessary. You may need a Car Diagnostic Service or an Engine Tune-Up."
          ]
        },
  
        {
          "tag": "heater_only_cold_air",
          "patterns": [
            "Why does my car’s heater only blow cold air?",
            "Why is my heater not working?",
            "Why is my car not getting warm?",
            "Why does my heater take too long to warm up?",
            "Why is my car blowing cold air instead of heat?",
            "What causes a heater to stop blowing warm air?",
            "Why is my heater cold even when my engine is hot?",
            "Why is my defroster not working properly?"
          ],
          "responses": [
            "If your car’s heater is only blowing cold air, the issue could be a low coolant level, a stuck thermostat, air trapped in the cooling system, or a malfunctioning heater core. You may need an Air Conditioning Repair & Recharge or a Car Diagnostic Service."
          ]
        },
        {
          "tag": "low_coolant_heater_issue",
          "patterns": [
            "Can low coolant cause my heater to not work?",
            "Why is my heater blowing cold air after I refilled coolant?",
            "Why does my car lose heat when idling?",
            "What happens if my coolant is too low?",
            "Why does my heater only work when I’m driving?"
          ],
          "responses": [
            "Low coolant levels can prevent hot fluid from reaching the heater core, causing your heater to blow cold air. Refilling the coolant and checking for leaks may fix the problem. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "stuck_thermostat",
          "patterns": [
            "Can a bad thermostat cause my heater to stop working?",
            "Why does my heater take so long to warm up?",
            "Why does my engine heat up, but my heater stays cold?",
            "Why is my heater warm sometimes but cold other times?",
            "What happens if my thermostat is stuck open?"
          ],
          "responses": [
            "A stuck thermostat can prevent the engine from reaching the proper temperature, causing your heater to blow cold air. Replacing the thermostat may solve the issue. You may need an Engine Tune-Up."
          ]
        },
        {
          "tag": "heater_core_issue",
          "patterns": [
            "Can a bad heater core cause my heater to not work?",
            "Why does my heater smell like coolant?",
            "Why is there fog inside my car when I turn on the heat?",
            "What happens if my heater core is clogged?",
            "Why is my car overheating and my heater not working?"
          ],
          "responses": [
            "A clogged or leaking heater core can prevent heat from reaching the cabin. If you smell coolant or see foggy windows, your heater core may need repair. You may need an Air Conditioning Repair & Recharge."
          ]
        },
        {
          "tag": "air_in_cooling_system",
          "patterns": [
            "Can air in the coolant system cause my heater to stop working?",
            "Why does my heater blow cold air randomly?",
            "Why does my heater stop working after I replace the coolant?",
            "What happens if air gets trapped in the cooling system?",
            "How do I know if I have air bubbles in my coolant?"
          ],
          "responses": [
            "Air trapped in the cooling system can prevent coolant from flowing properly, causing your heater to blow cold air. Bleeding the system may fix the problem. You may need a Car Diagnostic Service."
          ]
        },
        {
          "tag": "ac_weird_noise",
          "patterns": [
            "Why is my AC making a weird noise when I turn it on?",
            "Why does my car's AC make a loud noise?",
            "Why is my air conditioner making a rattling sound?",
            "Why does my AC sound like it's struggling?",
            "Why is my AC squealing when I turn it on?",
            "What causes a clicking noise in my car’s AC?",
            "Why does my AC make a buzzing noise?",
            "Why is my car AC compressor making a knocking sound?"
          ],
          "responses": [
            "If your AC makes a weird noise when turned on, it could be due to a failing compressor, a loose belt, debris in the blower motor, or low refrigerant levels. You may need an Air Conditioning Repair & Recharge or a Car Diagnostic Service."
          ]
        },
        {
          "tag": "ac_compressor_failing",
          "patterns": [
            "Why does my AC compressor make a knocking noise?",
            "Why is my AC making a grinding noise?",
            "Why does my AC sound like metal scraping?",
            "Can a bad compressor cause AC noise?",
            "What happens when an AC compressor goes bad?"
          ],
          "responses": [
            "A failing AC compressor can make knocking, grinding, or screeching sounds, indicating internal damage. It may need repair or replacement. You may need an Air Conditioning Repair & Recharge."
          ]
        },
        {
          "tag": "ac_belt_loose_or_worn",
          "patterns": [
            "Why does my AC make a squealing noise?",
            "Why does my AC belt squeak when I turn it on?",
            "Why does my AC make a high-pitched noise?",
            "What causes a whining noise when I use my AC?",
            "Can a loose belt make my AC noisy?"
          ],
          "responses": [
            "A loose or worn AC belt can cause squealing or high-pitched noises. Replacing or tightening the belt can fix the issue. You may need an Engine Tune-Up."
          ]
        },
        {
          "tag": "ac_blower_motor_debris",
          "patterns": [
            "Why does my AC make a rattling noise?",
            "Why does my AC sound like something is stuck inside?",
            "Why is my car AC making a clicking noise?",
            "Why does my AC sound like it's vibrating?",
            "What causes debris in the AC blower motor?"
          ],
          "responses": [
            "Rattling or clicking noises in the AC can be caused by debris in the blower motor or loose fan blades. Cleaning the blower motor may fix the issue. You may need an Air Conditioning Repair & Recharge."
          ]
        },
        {
          "tag": "ac_low_refrigerant",
          "patterns": [
            "Can low refrigerant make my AC noisy?",
            "Why does my AC make a hissing noise?",
            "Why is my AC making a bubbling sound?",
            "Why does my AC sound weak when it's running?",
            "What happens if my AC refrigerant is too low?"
          ],
          "responses": [
            "Low refrigerant levels can cause hissing, bubbling, or weak airflow noises in your AC. A recharge may be needed. You may need an Air Conditioning Repair & Recharge."
          ]
        },
  
  
  
        {
          "tag": "defroster_not_working",
          "patterns": [
            "Why is my defroster not working?",
            "Why is my windshield not defogging?",
            "Why is my rear defroster not clearing the glass?",
            "What causes a car defroster to stop working?",
            "Why does my defroster blow cold air?",
            "Why is my defroster weak and slow?",
            "Why is my defroster making a weird noise?",
            "Why is my defroster only working on one side?"
          ],
          "responses": [
            "If your defroster isn't working properly, it could be due to a malfunctioning blower motor, clogged vents, low coolant levels, a faulty thermostat, or a broken rear defroster grid. You may need an Air Conditioning Repair & Recharge or a Car Diagnostic Service."
          ]
        },
        {
          "tag": "defroster_blower_motor_issue",
          "patterns": [
            "Why is my defroster making a weird noise?",
            "Why does my defroster sound like it's struggling?",
            "Why is my defroster fan not working?",
            "Why does my defroster blow weak air?",
            "What happens if my blower motor fails?"
          ],
          "responses": [
            "A weak or noisy defroster could be caused by a failing blower motor. Replacing or repairing it may restore airflow. You may need an Air Conditioning Repair & Recharge."
          ]
        },
        {
          "tag": "defroster_clogged_vents",
          "patterns": [
            "Why is my defroster weak and slow?",
            "Why does my defroster take too long to work?",
            "Why does my windshield stay foggy even with the defroster on?",
            "Why is air barely coming out of my defroster vents?",
            "How do I fix blocked defroster vents?"
          ],
          "responses": [
            "Clogged or dirty vents can restrict airflow, preventing your defroster from working effectively. Cleaning the vents can help. You may need an Air Conditioning Repair & Recharge."
          ]
        },
        {
          "tag": "defroster_low_coolant_or_thermostat_issue",
          "patterns": [
            "Why does my defroster blow cold air?",
            "Why is my defroster not getting warm?",
            "Why does my defroster take so long to heat up?",
            "Why is my defroster lukewarm instead of hot?",
            "What causes a defroster to stop heating?"
          ],
          "responses": [
            "A defroster blowing cold air could indicate low coolant levels or a faulty thermostat. Checking and refilling coolant or replacing the thermostat may fix the issue. You may need an Engine Tune-Up or a Car Diagnostic Service."
          ]
        },
        {
          "tag": "rear_defroster_broken",
          "patterns": [
            "Why is my rear defroster not clearing the glass?",
            "Why does my rear defroster not work at all?",
            "Why is my rear defroster only working in some spots?",
            "Why does my rear defroster turn on but not clear fog?",
            "What causes a rear defroster to fail?"
          ],
          "responses": [
            "A rear defroster not working properly may be due to a broken defroster grid, a blown fuse, or a wiring issue. Repairs may be needed. You may need a Car Diagnostic Service or a Windshield Repair & Replacement."
          ]
        },
        {
          "tag": "windshield_wipers_not_working",
          "patterns": [
            "Why are my windshield wipers not working?",
            "Why did my windshield wipers suddenly stop working?",
            "Why won’t my windshield wipers turn on?",
            "Why are my wipers stuck in one position?",
            "Why do my windshield wipers move very slowly?",
            "Why are my windshield wipers making a weird noise but not moving?"
          ],
          "responses": [
            "If your windshield wipers aren't working, it could be due to a blown fuse, a bad wiper motor, broken wiper arms, or a faulty switch. A Car Diagnostic Service or Wiper Motor Repair may be needed."
          ]
        },
        {
          "tag": "wiper_motor_failure",
          "patterns": [
            "Why are my windshield wipers moving slowly?",
            "Why do my wipers struggle to move?",
            "Why are my wipers making a clicking noise but not moving?",
            "Why do my windshield wipers work sometimes but not always?",
            "What happens if my wiper motor fails?"
          ],
          "responses": [
            "A weak or non-functional wiper motor can cause slow or stuck wipers. Replacing the motor may fix the issue. A Wiper Motor Repair or Replacement is recommended."
          ]
        },
        {
          "tag": "wiper_fuse_blown",
          "patterns": [
            "Why did my windshield wipers suddenly stop working?",
            "Why did my wipers stop working after heavy rain?",
            "Why won’t my wipers turn on at all?",
            "Why do my wipers not respond when I turn the switch?",
            "What happens if my wiper fuse blows?"
          ],
          "responses": [
            "A blown fuse can prevent wipers from working. Replacing the fuse may restore function. A Fuse Check & Replacement is recommended."
          ]
        },
        {
          "tag": "wiper_arms_broken_or_loose",
          "patterns": [
            "Why are my windshield wipers not touching the glass?",
            "Why do my wipers move but don’t clear the windshield?",
            "Why do my wipers work but leave streaks?",
            "Why does one of my wipers not move while the other does?",
            "Why do my wiper arms feel loose?"
          ],
          "responses": [
            "Loose or broken wiper arms can cause poor wiping performance. Tightening or replacing the wiper arms may fix the issue. A Wiper Arm Replacement or Adjustment is recommended."
          ]
        },
        {
          "tag": "wiper_linkage_problem",
          "patterns": [
            "Why are my windshield wipers not moving even though I hear the motor?",
            "Why do my wipers move out of sync?",
            "Why do my windshield wipers stop halfway and not return?",
            "Why do my wipers make a clunking sound when moving?",
            "Why do my wipers only move a little and stop?"
          ],
          "responses": [
            "A broken or disconnected wiper linkage can stop wipers from functioning properly. Repairing or replacing the linkage may solve the problem. A Wiper Linkage Repair is recommended."
          ]
        },
        {
          "tag": "wiper_switch_failure",
          "patterns": [
            "Why don’t my wipers respond when I turn the switch?",
            "Why do my wipers work on some speeds but not others?",
            "Why do my windshield wipers not turn off?",
            "Why do my wipers randomly stop and start?",
            "Why is my wiper control switch not working?"
          ],
          "responses": [
            "A faulty wiper switch can cause erratic wiper behavior. Replacing the switch may be necessary. A Wiper Switch Replacement is recommended."
          ]
        },
  
  
  
        {
          "tag": "dashboard_warning_lights_on",
          "patterns": [
            "Why is my dashboard lit up with warning lights?",
            "Why are multiple warning lights on my dashboard?",
            "Why is my check engine light, ABS light, and battery light on at the same time?",
            "Why did all my dashboard warning lights turn on suddenly?",
            "What does it mean when my dashboard is full of warning lights?",
            "Why are my dashboard lights flickering?"
          ],
          "responses": [
            "If multiple warning lights appear on your dashboard, it may indicate an electrical issue, a failing alternator, or a system-wide malfunction. A full diagnostic scan is recommended to determine the cause."
          ]
        },
        {
          "tag": "check_engine_light",
          "patterns": [
            "Why is my check engine light on?",
            "Why did my check engine light turn on after refueling?",
            "Why is my check engine light flashing?",
            "Why does my check engine light come on and off?",
            "Why is my check engine light on but the car runs fine?"
          ],
          "responses": [
            "The check engine light can indicate engine misfires, sensor failures, or fuel system issues. A diagnostic scan can pinpoint the exact problem."
          ]
        },
        {
          "tag": "battery_warning_light",
          "patterns": [
            "Why is my battery warning light on?",
            "Why did my battery light turn on while driving?",
            "Why won’t my battery light turn off?",
            "Why is my battery light flickering?",
            "What does it mean when my battery light is on?"
          ],
          "responses": [
            "A battery warning light may indicate a failing alternator, a weak battery, or a charging system problem. A Battery & Alternator Test is recommended."
          ]
        },
        {
          "tag": "abs_light_on",
          "patterns": [
            "Why is my ABS light on?",
            "What does it mean if my ABS light is on?",
            "Why are my ABS and traction control lights on?",
            "Why did my ABS light turn on after I hit a pothole?",
            "Why does my ABS light keep coming on and off?"
          ],
          "responses": [
            "An ABS warning light can indicate issues with the anti-lock braking system, such as faulty wheel speed sensors or low brake fluid. A Brake System Diagnostic is recommended."
          ]
        },
        {
          "tag": "oil_pressure_warning",
          "patterns": [
            "Why is my oil pressure light on?",
            "Why did my oil light turn on while driving?",
            "Why does my oil pressure light flicker?",
            "Why is my oil light on even after an oil change?",
            "What should I do if my oil pressure warning light is on?"
          ],
          "responses": [
            "Low oil pressure can indicate an oil leak, a failing oil pump, or low engine oil. Driving with low oil pressure can cause engine damage. An Oil Pressure Test is recommended."
          ]
        },
        {
          "tag": "coolant_temperature_warning",
          "patterns": [
            "Why is my coolant temperature light on?",
            "Why did my temperature warning light turn on?",
            "Why is my car overheating with the coolant light on?",
            "Why does my coolant warning light keep flashing?",
            "What should I do if my engine temperature light comes on?"
          ],
          "responses": [
            "The coolant temperature warning light indicates overheating, which may be caused by a coolant leak, a bad thermostat, or a failing water pump. Immediate action is required to prevent engine damage."
          ]
        },
        {
          "tag": "traction_control_light_on",
          "patterns": [
            "Why is my traction control light on?",
            "What does it mean if my traction control light stays on?",
            "Why does my traction control light turn on when I accelerate?",
            "Why is my traction control light flashing?",
            "Why did my traction control light turn on after driving in the rain?"
          ],
          "responses": [
            "A traction control warning light may indicate a malfunctioning wheel speed sensor, slippery road conditions, or a disabled stability control system. A Traction Control System Diagnostic is recommended."
          ]
        },
        {
          "tag": "airbag_warning_light",
          "patterns": [
            "Why is my airbag light on?",
            "Why did my airbag warning light turn on?",
            "What does it mean if my airbag light stays on?",
            "Why is my airbag light flashing?",
            "Why is my airbag warning light on after an accident?"
          ],
          "responses": [
            "An airbag warning light can indicate a faulty airbag sensor, a disconnected seatbelt sensor, or an airbag system malfunction. An Airbag System Diagnostic is recommended."
          ]
        },
        {
          "tag": "sluggish_acceleration",
          "patterns": [
            "Why does my car feel sluggish when I press the gas?",
            "Why is my car not accelerating properly?",
            "Why does my car feel slow even when I press the pedal?",
            "Why does my car struggle to speed up?",
            "Why is there a delay when I press the gas pedal?",
            "Why does my car hesitate before accelerating?"
          ],
          "responses": [
            "Sluggish acceleration can be caused by fuel delivery issues, clogged air filters, faulty sensors, transmission problems, or engine misfires. A Fuel System Inspection or Engine Diagnostic is recommended."
          ]
        },
        {
          "tag": "rattling_noise_underneath",
          "patterns": [
            "Why is my car making a rattling noise underneath?",
            "Why do I hear a rattling sound from under my car?",
            "Why does my car rattle when driving or idling?",
            "What causes a rattling noise under my vehicle?",
            "Why is my undercarriage making a metallic rattling sound?",
            "Why do I hear a clunking or rattling noise when I go over bumps?"
          ],
          "responses": [
            "A rattling noise underneath your car could be caused by a loose exhaust component, heat shield, or a failing catalytic converter. A Suspension or Exhaust System Inspection is recommended."
          ]
        },
        {
          "tag": "exhaust_leak_or_damage",
          "patterns": [
            "Why is my car making a loud exhaust noise?",
            "Why does my car sound louder than usual?",
            "Why do I hear a hissing or popping sound near my exhaust?",
            "Why is my muffler rattling or vibrating?",
            "Why do I smell exhaust fumes inside my car?",
            "Why is my car making a whistling sound near the tailpipe?"
          ],
          "responses": [
            "A loud or unusual exhaust noise could indicate a leak, rust damage, or a failing muffler. It’s best to get an Exhaust System Inspection."
          ]
        },
        {
          "tag": "loose_heat_shield",
          "patterns": [
            "Why is my car making a metallic rattling noise near the engine?",
            "Why do I hear a buzzing sound from under my car?",
            "What does it mean if my heat shield is loose?",
            "Why does my car rattle when I start it?",
            "Why is there a vibrating noise when I accelerate?"
          ],
          "responses": [
            "A loose heat shield can cause a metallic rattling or buzzing noise, especially when accelerating. A quick Exhaust System Check can confirm if repairs are needed."
          ]
        },
        {
          "tag": "suspension_rattle",
          "patterns": [
            "Why do I hear a rattling sound when I go over bumps?",
            "Why does my suspension make noise when I drive?",
            "Why do I hear clunking or knocking under my car?",
            "Why does my car rattle when I hit a pothole?",
            "Why do I hear a loose knocking sound from my wheels?"
          ],
          "responses": [
            "A rattling or clunking sound over bumps could indicate loose suspension components, worn-out bushings, or damaged struts. A Suspension Inspection is recommended."
          ]
        },
  